{"title": "Meta Post : {{ Hello again, Humans ! }}", "body": "Hello all,  *(Message to the mods: this is a Meta post, please contact me if something is wrong!)*  # The goodreads-bot Legacy  As you must know if you were already here last year, our beloved bot u/goodreadsbot stopped working in January after having been used **156.631** times on this subreddit by a total of **25.272** different users, because goodreads shut down API access.  As a bored nerd and fellow reader, I decided to start a new toy project: rise our bot back! But because the Goodreads API is now closed, the first task was to build my own Books database... which I did, using Reddit, Goodreads & Google Books.  This new bot called u/goodreads-rebot (\"bot\" + \"reboot\" = \"rebot\".....) is open source (link to source code below). I wanted to thank u/ArtyomR, the author of u/goodreadsbot, for the original idea. I am not u/ArtyomR, but I have great respect for his/her work and its legacy. Thank you!  # How does it work? Just like before! (with more features)  Write `{{Harry Potter}} in your post` or alternatively `{{A Little Life by Hanya Yaniagara}} (notice the typo)` with a **\"by\"**  and the bot will answer with more information about the **book** or the **series**.  The search part is now part of the bot (and not on Goodreads API side), and was quite challenging to handle. **You definitely should specify the author with the \"by\" keyword**, because it helps the Database search.   **Examples:**  `You should read {{Harry Potter}} !` will work, it will recognize it as the name of a **Series**, in that case it will provide information about **the first book of the Series;**  `My favorite book is {{Call Me By Your Name}}` will work too, the bot will try to find a book called **Call Me** by author named **Your Name** (because of the \"by\" keyword...) but it will fail to find one, so as a 2nd try because it's not *that* dumb, it will indeed find a book called **Call Me By Your Name** :)  `Did you read {{1984 by Michael Radford}}?` (notice the wrong author): it will work too even if the author is wrong, because when the search fails using the author, it will try again ignoring it.  # Features  I added a \"Top 2 recommended-along\" section, featuring the 2 books that were the most recommended here on Reddit in the same threads than the book described. It is based on another toy project of mine (😅), a book recommending algorithm I am working on, which is based on the co-occurences of book titles in Reddit threads. Let me know if you find this new information useful.  # Limitations  As explained before, the bot is based on a book database I build and update as much as I can. The search will sometimes fail to match some existing books, in particular very niche books, or the recent ones. I am working on having the best and up-to-date database as possible, meanwhile sorry for the misses!  Also, the bot is currently not running on other subreddits (like r/booksuggestions), but because the code is really modular, it's just about configurations. FYI this is in the roadmap for the next few days/weeks.  Finally, I may reach some rate posting limits because of low karma. Hopefully, this will be solved soon after some time thanks to your help :)  You will find below more information (links being forbidden in posts).  I think that's it.   See you there!", "comments": ["Thank you for your time, energy, and resources into Goodreads-Rebot. LONG MAY THEY REIGN!", "👇 Here is what answers look like:\n\n\\#1/3: **[Harry Potter and the Sorcerer's Stone (Harry Potter #1)](https://www.goodreads.com/book/show/3.Harry_Potter_and_the_Sorcerer_s_Stone) by J.K. Rowling** ^(&#40;Matching 100% ☑️&#41;)\n\n^(309 pages | Published: 1997 | Suggested 14 times)\n\n\n> **Summary:** Harry Potter's life is miserable. His parents are dead and he's stuck with his heartless relatives. who force him to live in a tiny closet under the stairs. But his fortune changes when he receives a letter that tells him the truth about himself: he's a wizard. A mysterious visitor rescues him from his relatives and takes him to his new home. Hogwarts School of Witchcraft and Wizardry. After a lifetime of bottling up his magical powers. Harry finally feels like a normal kid. (...)\n\n> **Themes**: Fantasy, Fiction, Young-adult, Harry-potter, Books-i-own\n\n> **Top 2 recommended-along**: [The Casual Vacancy - Perebutan Kursi Kosong](https://www.goodreads.com/book/show/16173852-the-casual-vacancy---perebutan-kursi-kosong) by J.K. Rowling, [The Hunger Games Series](https://www.goodreads.com/book/show/2767052-the-hunger-games) by Suzanne Collins\n---\n\\#2/3: **[Call Me By Your Name (Call Me By Your Name #1)](https://www.goodreads.com/book/show/36336078-call-me-by-your-name) by André Aciman** ^(&#40;Matching 100% ☑️&#41;)\n\n^(248 pages | Published: 2007 | Suggested 77 times)\n\n\n> **Summary:** Call Me by Your Name is the story of a sudden and powerful romance that blossoms between an adolescent boy and a summer guest at his parents' cliff-side mansion on the Italian Riviera. Unprepared for the consequences of their attraction. at first each feigns indifference. But during the restless summer weeks that follow. unrelenting buried currents of obsession and fear. fascination and desire. intensify their passion as they test the charged ground between them. What grows (...)\n\n> **Themes**: Fiction, Romance, Lgbt, Lgbtq, Contemporary\n\n> **Top 2 recommended-along**: [The Wings of the Dove](https://www.goodreads.com/book/show/124272.The_Wings_of_the_Dove) by Henry James, [Find Me (Call Me By Your Name, #2)](https://www.goodreads.com/book/show/44581535-find-me) by André Aciman\n---\n\\#3/3: **[1984](https://www.goodreads.com/book/show/40961427-1984) by George Orwell** ^(&#40;Matching 100% ☑️&#41;)\n\n^(298 pages | Published: 1949 | Suggested 221 times)\n\n\n> **Summary:** Among the seminal texts of the 20th century. Nineteen Eighty-Four is a rare work that grows more haunting as its futuristic purgatory becomes more real. Published in 1949. the book offers political satirist George Orwell's nightmarish vision of a totalitarian. bureaucratic world and one poor stiff's attempt to find individuality. The brilliance of the novel is Orwell's prescience of modern life—the ubiquity of television. the distortion of the language—and his ability to (...)\n\n> **Themes**: Classics, Fiction, Science-fiction, Dystopia, Dystopian\n\n> **Top 2 recommended-along**: [Brave New World](https://www.goodreads.com/book/show/5129.Brave_New_World) by Aldous Huxley, [Animal Farm](https://www.goodreads.com/book/show/170448.Animal_Farm) by George Orwell\n\n^( [Provide Feedback](https://docs.google.com/forms/d/e/1FAIpQLSctJFIlf7XR_3y0ZOELiDFYufSKJBKlxE9hUFXz4CGIwBXAQQ/viewform?usp=pp_url) | [Source Code](https://github.com/sonoff2/goodreads-rebot) )", "Just wanted to say wow, this is amazing!!\n\nHave you heard of [https://hardcover.app](https://hardcover.app)? I've started tracking my books there, in an effort to break from Goodreads. I'm not sure about their API, but maybe it would be helpful for your bot?", "Thanks for bringing it back", "Good bot", "So if I said tell me more about {{Fourth Wing}}....", "ReBot from House Goodreads, may your reign never end <3", "Should I read {{The Poisonwood Bible by Kingsolver}}?", "So, is this working or what? I just tried using it and nothing.", "{{The witch collector}}"], "suggested_books": ["Find Me"], "score": 304, "id": "16qe09p", "url": "https://www.reddit.com/r/suggestmeabook/comments/16qe09p/meta_post_hello_again_humans/"}
{"title": "The one “self help” book that actually changed your and your outlook on life?", "body": "Comment the one personal development book that actually taught you how to change and helped to improve your character in general.", "comments": ["How to Keep House While Drowning", "Adult Children of Emotionally Immature Parents, by Dr. Lindsay Gibson", "Four thousand weeks, really changes your priorities ", "Wintering by Katherine May - part memoir part self help, it let me come to terms with the cyclical nature of life, inspired me to embrace the “winters” of my life as a chance to go inward and reflect, and gave me a newfound respect / fondness for the winter weather and what a gift it actually is. Combined with the concept of Hygge (Meik Wiking’s book on Hygge is also great) it has given me a new lease on life and actually helped me embrace the cycles life can take. ", "The Gift of Fear by Gavin DeBecker", "The Art of Mindful Living Thich Nhat Hanh", "Adult Children of Alcoholics", "Man's Search for Meaning by Viktor Frankl.", "Not sure if you can put this in “self help” but The Artist Way by Julia Cameron! She dives deep into the blocks that keep us from creativity/a creative life and through exercises helps heal some of that trauma. Because of that book, I quit my toxic job, spent a chunk of 2023 on a cross country road trip, and am now trying to write a book. Honestly, it’s all about healing your inner child (regardless if you consider yourself “creative”) so I cannot recommend that one enough! ", "Why Does He Do That by Lundy Bancroft. It helped me deal with a lot of (misplaced) guilt over leaving my abusive ex. "], "suggested_books": ["Adult Children of Emotionally Immature Parents,", "The Gift of Fear", "Man's Search for Meaning", "self help", "The Artist Way", "Why Does He Do That"], "score": 139, "id": "1jmxfca", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmxfca/the_one_self_help_book_that_actually_changed_your/"}
{"title": "What book left a lasting impact for you and why?", "body": "Hi all! I'd love to hear book suggestions on those that made a lasting impact for you. It could be that you simply think about it frequently or maybe it was due to the time that you read it. I'm open to any genre!", "comments": ["Elie Wiesel’s “Night.”  Everyone should read it.", "The Magus by John Fowles. It's literary fiction. Read it for the first time when I was 24. Raced through it in two and a half days (it's a long book). Finished it in the middle of the night, slept fitfully for a couple of hours and woke up depressed I could no longer live in it, so I started over from the beginning.\n\nI'm turning 60 this year, and I've now read it about 20 times. I've read thousands of books, this is my all time favourite - it has everything.\n\nDon't want to say too much about the plot, so I'll just leave you with the last sentences of part 1:\n\n\"I did not think about the future. In spite of what the doctor at the clinic had said I felt certain that the cure would fail. The pattern of destiny seemed clear: down and down, and down.\n\nBut then the mysteries began.\"", "I Who Have Never Known Men. Read it almost a year ago. Still think about it every day. A masterpiece. So many question that were left unanswered.", "The Power of Now. read it about 2 weeks ago and i have genuinely not been the same. i would recommend every person on earth read this book", "A thousand splendid suns", "Les Miserables.....a book that will make you think about every aspect of the human condition.  I was a different person upon finishing that book....reading it can only strengthen your character.", "All Quiet On The Western Front. It's my favorite book of all time and I rarely go a day without it crossing my mind. It literally changed every idea I had about WW1. Truly heartbreaking too.", "East of Eden. Never thought it would affect me as it has. Amazing", "Never let me go. That book hurt me to my soul. It seemed to me it was about the extreme and utter coldness of the human race.", "The Measure. In this world when you turn 22, you get a box on your doorstep that contains a string. The length of the string tells you how long you live for. Do you look at the string? Throw it away? If it’s short, how does it shape how you would live your life? \n\nI think about whether I would look at my string all the time"], "suggested_books": ["The Magus", "The Power of Now"], "score": 57, "id": "1jmw6j6", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmw6j6/what_book_left_a_lasting_impact_for_you_and_why/"}
{"title": "Are there any inspiring fiction or nonfiction books about people reinventing themselves or starting over in midlife or beyond?", "body": "LF inspiring fiction or nonfiction books about people restarting lives in mid 30/40/ 50s or beyond? Dealing with failures and setbacks or lack of motivation   Bonus if women centric. Like women who have to restart after raising children etc.", "comments": ["The many lives of mama love is AMAZING. It’s a memoir that literally feels like reading fiction. Soccer mom turned heroine addict turned ghostwriter for the Dalai Lama", "Where’d You Go Bernadette? By Maria Semple\n\nBritt Marie was Here by Frederick Bachman \n\nEleanor Oliphant is completely Fine by Gail Honeyman", "The Wedding People\n\nI can’t remember the last time I enjoyed a book so!", "Iona Iverson’s Rules for Commuting: A Novel by Clare Pooley is delightful and fits here.", "Someone gave me the book Ten Years Later when I was going through some tough times.  It was very inspirational.  All true stories of people who bounced back from bad situations.  It’s by Honda Kotb with Jane Lorenzini.  I would recommend it to help anyone to see the long distance perspective of life.", "Well you know, the stormlight archive has characters which grow through mental health issues with some characters being middle aged", "The Wind-Up Bird Chronicle by Haruki Murakami", "The most fun we ever had \n\nThis definitely has one or two main characters that jive with this vibe!", "Britt Marie Was Here by Fredrik Backman \n\nFiction about an older woman who is afraid no one will realize she's gone when she dies.  So she tries getting a job for the first time in her life.  The only job she can get is taking care of a building in a town she's never been to and the town is dying.\n\n******\nHow the Penguins Saved Veronica by Hazel Prior \n\nAn elderly woman wants to leave her money to an artic research team but wants to visit them first, whether they want her to or not.", "Wild by Cheryl Strayed"], "suggested_books": ["Britt Marie was Here", "Eleanor Oliphant is completely Fine", "The Wind-Up Bird Chronicle", "Britt Marie Was Here", "How the Penguins Saved Veronica"], "score": 20, "id": "1jn01rj", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn01rj/are_there_any_inspiring_fiction_or_nonfiction/"}
{"title": "For ebook readers, what book have you liked so much that you bought a physical copy of it?", "body": "Just want to get ideas on what physical books are worth buying and spending money on. Thank you!", "comments": ["The Discworld Companion.", "Our Wives Under The Sea by Julia Armfield - this was the first I did that for, and the only one that I knew pretty much as soon as I finished it that I needed a physical copy.", "An indie novella called Sistah Samurai by Tatiana Obey. I just got an autographed hardcover in the mail. It’s not a perfect novella by any means, but I really enjoyed it and wanted to support the author.", "Piranesi by Susanna Clarke. ", "Prime time romance and this spells love by Kate Robb", "Book of doors and the unmaking of June farrow. Ghosts by dolly alderton is next", "*The dawn of everything* by Davids Graeber and Wengrow", "Malazan. Started with ebooks but had to buy physical copies just for the sheer brilliance of these books!", "The Nightingale by Kristin Hannah. I originally read it on Kindle 10 years ago and bought the 10th anniversary hardcover this week.", "Remarkably bright creatures"], "suggested_books": ["Our Wives Under The Sea", "Piranesi", "The dawn of everything", "The Nightingale"], "score": 7, "id": "1jn5nu6", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn5nu6/for_ebook_readers_what_book_have_you_liked_so/"}
{"title": "A very engaging book that you finish in one sitting", "body": "Fiction or non fiction books that you couldnt’t put down", "comments": ["A Short Stay In Hell", "If one sitting is a few hours you can read most Agatha Christie's or Conan Doyle's mysteries.", "Murderbot: All Systems Red. A delightful novel by Martha Wells.", "Anything by Agatha Christie.", "Into thin air by John Krakauer", "The Giving Tree by Shel Silverstein.", "The Giver. So good, so easy to read. And it’s a series!", "The road by cormac McCarthy", "Any of the discworld books", "People talk about, but the DaVinci Code. It really is a page turner."], "suggested_books": ["Into thin air", "The Giving Tree"], "score": 69, "id": "1jmpi4o", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmpi4o/a_very_engaging_book_that_you_finish_in_one/"}
{"title": "“Competence porn” books", "body": "Looking for books about people being extremely good at their jobs. I’ll take any profession, any genre.", "comments": ["The Lies of Locke Lamora. It’s like if Batman was raised as a pickpocket.\n\nThere’s a scene about 80% in where he finally pushes himself and it’s one of the funniest sequences I’ve ever read.", "The Day of the Jackal by Frederick Forsyth\n\nThe Sherlock Holmes novels", "Patrick O'Brien's *Master & Commander* series. What's fascinating is the contrast between the two main characters. The captain is an exemplar of competence at sea, and a fool on land. He can smoke out any ship flying false colors, but is a sucker for any scammer. The Doctor is a skilled physician and a master spy, but even after a decade at sea knows next to nothing about ships.", "Not a book but this is a huge appeal of all the pretty much all the star treks\n\n\nBut Andy weir has done this well. The Martian and project hail Mary. ", "A Connecticut Yankee in King Arthur’s Court", "The siege trilogy by KJ Parker, starting with \"16 ways to defend a walled city\".  A very competant engineer winds up leading the defense of a city under seige.  He uses wits to navigate the various factions of the city to create very clever solutions to problems while defending the city while it is under attack.  The narrator's voice is charming and fun.  When I think of \"comopetence porn\", this (along with Andy Weir's novels) are the first things I come to.", "The pendergast series by Douglas preston and Lincoln childs. \n\nHe’s a bit like a modern day Sherlock", "Sabriel by Garth Nix about an extremely competent young woman who is a necromancer and calmly shoulders a terrible responsibility. ", "The Martian. Hands down a great example of competence porn.", "Girl with the dragon tattoo"], "suggested_books": ["The Day of the Jackal", "Master & Commander", "Sabriel"], "score": 84, "id": "1jmn0ns", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmn0ns/competence_porn_books/"}
{"title": "Need a good book for my flight", "body": "Hi everyone! I’m flying cross country in a week and would love some book suggestions for the long flight. I have ADHD so I need a book that grabs my attention and is easy to follow, nothing slow paced. I prefer Non Fiction but will read fiction if it’s really good. My reading interests are anything true crime, history(American Revolution, WW2 ect), self help (depression, anxiety, adhd) & fitness/weight loss.  Thanks in advance! 😃", "comments": ["Into Thin Air, Jon Krakauer’s account of the disastrous 1996 Everest Climbing Season.", "Just started reading “Say Nothing: A true story of murder and memory in Northern Ireland.”\n\nDefinitely gripped me in the first chapter. ", "Have you read any Mary Roach? Super attention-grabbing!", "I’m very similar and found that Radium Girls was fascinating, maybe you would too", "9/11 Unmasked by David Ray Griffin", "The Tasters by Rosella Postorino", "Not the best books for flying, but I really enjoy the books by TJ Newman.\n\nFalling,\nDrowning,\nWorst Case Scenario\n\nMaybe try reading those after your flight.", "*Enemy at the Gates: The Battle for Stalingrad* by William Craig.", "I have a list. \n1. The Goat Brothers By Larry Colton, \nThis should be required reading for all highschool seniors. \n2. A Fine Balance By Rohan Mistry, \nGot me out of a reading slump. \n3. L.A. Rex  By Will Beall, \nThis should be a T.V.  series, \n4. Tulia By Nate Blakeslee \nThis should also be a T.V. series. \nHope you find one you like.", "I just read The Girl with Seven Names by Hyeonseo Lee on my flights and loved it! It’s the true story of a North Korean defector."], "suggested_books": ["9/11 Unmasked", "The Tasters", "The Battle for Stalingrad*", "Enemy at the Gates: The Battle for Stalingrad"], "score": 7, "id": "1jn1tsz", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn1tsz/need_a_good_book_for_my_flight/"}
{"title": "Please suggest A book where you could tell early on that you were in For a great story.", "body": "What is a book you enjoyed where you could tell from the first chapter that this was going to be a great story?  Guy Gavriel Kay and Thomas Perry are two examples of authors that often hit me like that.", "comments": ["Circe I don’t know if I ever liked a book so fast into starting it. I also rarely ever checked how many pages were left in the chapter when I was reading it which I do for other books a good amount.", "“I still remember the day my father took me to the Cemetery of Forgotten Books for the first time.”\nFirst Sentence of The Shadow of the Wind by Calos Ruiz Zafron.", "\"First, I got myself born. A decent crowd was on hand to watch, and they've always given me that much: the worst of the job was up to me, my mother being let's just say out of it.\" \n\nDemon Copperhead", "“To Kill A Mockingbird” had such a nice, calm way of describing the various characters so that you felt like you knew everyone in the story. It’s a masterpiece!", "First lines of Clan of the Cave Bear, Jean Auel", "The Kite Runner", "Classic:  Billy Pilgrim has become unstuck in time \n\nSlaughterhouse 5 Kurt Vonnegut", "A Gentleman in Moscow by Amor Towles hooked me immediately.", "The Nightingale by Kristin Hannah", "11.22.63. \n\nIt drew me straight in, was a very easy read."], "suggested_books": ["To Kill A Mockingbird", "A Gentleman in Moscow", "The Nightingale"], "score": 27, "id": "1jmrq85", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmrq85/please_suggest_a_book_where_you_could_tell_early/"}
{"title": "Self help book, focusing on OCD", "body": "Hey, all! I am not usually one for self help books but I am really struggling with my OCD at the moment, to the point where it’s nearly too much to stand. Can anyone suggest a book that I could read that may help? I figure this might ease it a bit considering I’m handling this all on my own. Thanks in advance!", "comments": ["I don't have a full book but look up the article How to stop ruminating by Dr. Michael Greene.", "[removed]", "Chatter by Ethan Kross\n\nOvercoming Unwanted Intrusive Thoughts by Sarah M. Winston\n\nMastering Intrusive Thoughts by Artem Kudelia\n\nThe Mindfulness Workbook for OCD by Jon Hershfield\n\nThe OCD Workbook by Bruce M. Hyman\n\nThe ACT Workbook for OCD by Marisa T. Mazza"], "suggested_books": ["The Mindfulness Workbook for OCD", "Overcoming Unwanted Intrusive Thoughts", "Mastering Intrusive Thoughts", "The OCD Workbook", "Chatter"], "score": 3, "id": "1jn3vfx", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn3vfx/self_help_book_focusing_on_ocd/"}
{"title": "Feel-good books.", "body": "Hii guys!  Could you please recommend some feel-good books with a happy ending? I’m currently in need of one and feel like reading something light, funny, or romantic.  Thank you!", "comments": ["Remarkably Bright Creatures", "Act Your Age, Eve Brown by Talia Hibbert\n\nSmall Miracles by Olivia Atwater\n\nThe Very Secret Society of Irregular Witches by Sangu Mandanna\n\nBoyfriend Material by Alexis Hall\n\nThe Truth According to Ember by Danica Nava\n\nLast Call at the Local by Sarah Grunder Ruiz\n\nThe House Witch by Delemhach\n\nFangs by Sarah Andersen\n\nThe Wisteria Society for Lady Scoundrels by India Holton\n\nMiss Percy’s Pocket Guide to the Care and Feeding of British Dragons by Quenby Olson", "aww, I get it. When I am feeling like this, I typically almost always reach for Fredrik Backman. Try A Man called Ove, or Anxious people. Very heartwarming.", "It’s not fiction, but the most fun I’ve ever had reading is Lindy West’s Shit Actually. I laughed out loud. \n\nLight, funny, romantic: Northanger Abbey by Jane Austen\n\nRomantic:\n\nBookshop on the Corner by Jenny Colman\n\nBromance Book Club\n\nSophie Irwin’s Lady’s Guide books", "Leonard and hungry paul", "Mrs. Nash's Ashes by Sarah Adler", "Reputation by Lex Croucher \n\nPrivileged by Zoey Dean", "Foster by Clair Keegan", "Brit Marie was Here \n\nA Man Called Ove \n\nEleanor Oliphant is Completely Fine \n\nThe Midnight Library", "The funny story - Emily Henry \n\nWith the fire on high-Elizabeth Acevedo"], "suggested_books": ["The House Witch", "The Very Secret Society of Irregular Witches", "Act Your Age, Eve Brown", "Boyfriend Material", "Miss Percy’s Pocket Guide to the Care and Feeding of British Dragons", "Last Call at the Local", "Small Miracles", "Bookshop on the Corner", "Mrs. Nash's Ashes", "Foster"], "score": 8, "id": "1jmzskl", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmzskl/feelgood_books/"}
{"title": "Books that have beautiful and complex relationships that go beyond romance", "body": "I’m really craving a book that has complex and strong relationships that aren’t the stereotypical romantic love. I’m talking like the two best friends that would tear the world down for each other or family/found family dynamics that really emphasize the emotional and heartfelt impact those type of relationships can have on a person.  It doesn’t even necessarily need to not have romance, but I’m not looking for that to be the strongest point of the story. A great example of this from a book I recently read (The Poppy War) is Rin and Altan’s very interesting dynamic as the last two of their race but also with a strong current of anger/tension and love on both sides.   Please help I need this vibe in my life 🙌", "comments": ["I run an indie imprint and our debut novel, A Million Tomorrows by Kris Middaugh, fits this description. Sweet, complex, detailed character development, some grounded sci fi. \n\nShould be able to find the ebook pretty much anywhere. B&N and Amazon also have an on demand print version.", "Was gonna suggest The Poppy War until you mentioned it in your post lol. The closest I'm thinking is The Serpent Called Mercy by Roanne Lau! The two main characters have a platonic relationship similar to Rin/Kitay, and I think their character development was one of the best parts of the book.", "*Still Life* by Sarah Winman is what you’re looking for!!", "The Celestial Kingdom Series", "I just recommended it on another post, but Martha C. Wells' *Witch King*."], "suggested_books": ["The Poppy War", "*Still Life*", "Still Life", "Witch King"], "score": 4, "id": "1jn2xky", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn2xky/books_that_have_beautiful_and_complex/"}
{"title": "Recs for Morally Gray Characters and No Clear “Right Answers”", "body": "I’m in the mood for a fiction book that really digs into moral gray areas. Ones where the characters face complex dilemmas and there is no obvious right answer.   I want to read something that makes me think, makes me feel conflicted and maybe even uncomfortable. I want to be left questioning the character’s decision sorta like “I can see why they did that but also… yikes”  I’m open to any genre. I’m a chameleon :)   So whats your favorite morally complex book?!", "comments": ["You're describing grimdark fantasy in a nutshell. \n\nThe most prominent author is Joe Abercrombie. His First Law trilogy is often recommended,  but I think you'd do well Starting with The Heros based on your prompt.  It's a stand alone novel set in the same world as the First Law.\n\nThe Black Company by Glenn Cook gets cited as one of the OG grimdark titles.  The story is good, but the style is a bit dated.\n\nThe Gentlemen Bastards series by Scott Lynch is one of my favorites. The protagonist is a thief and the books revolve around various heists.  Think of them as a fantasy version of the Ocean's movies and you won't be too far off the mark.\n\nIf you want truly deplorable protagonists Mark Lawrence has two trilogies for you to check out.  The Broken Empire and The Red Queen's War.  They have very different main characters, but both are told from the first person perspective so you get their inner monologue.  I think of Jorge and Jalen as the protagonists I love to hate.", "The Count of Monte Cristo", "I think In the Lives of Puppets by TJ Klune has a lot of this.  Hard themes about forgiveness and grappling the big decisions you've made.", "LA Confidential", "BRING UP THE BODIES by Hilary Mantel, about the downfall of Anne Boleyn\n\n“He needs guilty men, so he found men who are guilty — though not necessarily guilty as charged”", "The Ripley books by Patricia Highsmith, although the protagonist might be a very dark gray.", "Anything by John le Carre.", "Dirty Snow. Disgrace. The Darkroom of Damocles. The Reader.", "Many of Irvine Welsh's books, I've only read a few so far but Skagboys has been my favorite so far. Trainspotting is excellent too", "The Jack Taylor Series by Ken Bruen. \nDrug and alcohol addicted ex-garda turned reluctant detective who burns bridges faster then he can build them and his rash decisions has caused most of his own issues over the years. Also committed a truly shocking number of murders, most of which were somewhat justified."], "suggested_books": ["The Black Company", "BRING UP THE BODIES"], "score": 6, "id": "1jmyztw", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmyztw/recs_for_morally_gray_characters_and_no_clear/"}
{"title": "Books like “Tomorrow and Tomorrow and Tomorrow”", "body": "I love: 1. Complex characters as they are entangled in each other’s lives  2. Creative people being successful  3. Being set over a long period of time  4. How real the book felt  5. General vibes  6. The tech industry and smart people inventing stuff", "comments": ["I love Tomorrow, and Tomorrow, and Tomorrow and want to recommend Playground by Richard Powers", "If *Tomorrow and Tomorrow and Tomorrow* clicked with you on all those levels, here are a few books that might scratch a similar itch:\n\n**1.** ***The Interestings*** **by Meg Wolitzer**  \nTracks a group of creative teens from summer camp through adulthood, watching how their ambitions, relationships, and insecurities evolve over decades. It’s soaked in realism and emotional complexity, with just the right tension between success and envy.\n\n**2.** ***The Art of Fielding*** **by Chad Harbach**  \nYes, it’s about baseball, but not *really*. It’s about driven, obsessive people colliding at a small college, with themes of talent, identity, and the pressure to live up to your own mythology. Very emotionally layered, like *T&T&T*.\n\n**3.** ***Startup*** **by Doree Shafrir**  \nLeans harder into satire, but gives a sharp, inside look at startup culture, tech ambition, and the blurry ethics that sometimes come with success. Think of it as *T&T&T*'s snarky cousin.\n\n**4.** ***The Ensemble*** **by Aja Gabel**  \nFollows a string quartet over decades. The dynamic between the four musicians is tender, messy, competitive, and intimate. If you loved the creative entanglement in *T&T&T*, this hits similar emotional notes in a different world.\n\n**5.** ***Version Control*** **by Dexter Palmer**  \nA brilliant and strange literary sci-fi about time, memory, and relationships, set in a tech-adjacent future. It plays with time both literally and emotionally, and it’s packed with smart, flawed people trying to make meaning out of ambition and love.\n\nThat blend of big feelings and big ideas isn’t easy to find, but when you do, it *really* lands. Do you tend to lean more toward literary fiction or are you open to more speculative or genre-bending reads too?", "One Day by David Nichols has a similar feel to it imo! I really enjoyed it. Follows two friends every year on the day that they first met.", "*The Animators* by Kayla Rae Whitaker, about the friendship (and professional partnership) of two animators over the course of a dozen years from the beginning of college.", "\"The Magicians\" by Lev Grossman is a series of books that I think are most cheekily but fairly described as \"If Harry Potter and Narnia were about  horny alcoholics with depression\". They're very good.", "This is an outstanding list. And I wanted to mention that reading Tomorrow… years later instantly gave me The Interestings vibes. There are a lot of parallels within the storylines and both of are on my all time favorites lists!"], "suggested_books": ["The Art of Fielding", "The Interestings", "The Ensemble", "Tomorrow and Tomorrow and Tomorrow", "Version Control", "One Day", "\"The Magicians\"", "The Magicians"], "score": 9, "id": "1jmuts9", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmuts9/books_like_tomorrow_and_tomorrow_and_tomorrow/"}
{"title": "Fantasy for a non-fantasy reader", "body": "Hey all!  I read both fiction and non-fiction, but when it comes to fiction, I tend to avoid fantasy. I enjoy romance, crime, drama - basically anything as long as it feels grounded in reality. I’m not entirely sure why fantasy has never appealed to me, but I think it’s partly because I worry the worlds will be too complex to understand, and I find that fantasy has to be particularly well-written to maintain my suspension of disbelief. I also tend to connect more with stories when they feel like something that could actually happen.  That being said, I’m going through a rough time mentally and could really use a book that lets me escape into a different world - something immersive, engaging, and that I can’t put down. I don’t want anything with a super complex world or lore, just an easy-to-get-into story that still feels captivating. Ideally, it wouldn’t have any heavy or dark themes - I know cozy has been overused lately but… yeah that’s the vibe I’m looking for. It can be a standalone or a series.  If it is any help, the only fantasy books I remember enjoying were the Stardust series by Linda Chapman, which I read as a kid. I liked that it had a fantasy element and some suspense while still being set in the “real world” (maybe I should reread it now at 27? 😅)  I know this is a bit vague, but I’d love any recommendations you think might fit. Thanks in advance - I appreciate any suggestions!", "comments": ["The House in the Cerulean Sea by T.J. Klune\n\nThe Very Secret Society of Irregular Witches by Sangu Mandanna\n\nLegends & Lattes by Travis Baldree\n\nThe Paper Magician by Charlie N. Holmberg\n\nThe Night Circus by Erin Morgenstern\n\nThe Magicians by Lev Grossman\n\nThe Ten Thousand Doors of January by Alix E. Harrow\n\nHowl’s Moving Castle by Diana Wynne Jones\n\nSpinning Silver by Naomi Novik\n\nThe Goblin Emperor by Katherine Addison", "Spinning Silver by Naomi Novik would be my vote.", "Emily Lloyd-Jones wrote a trilogy of books:\n- The Bone Houses\n- The Drowned Woods\n- The Wild Huntress\n\n\nThey aren't a traditional trilogy, but they all connect, so I would recommend reading them in order. The world building is interesting without being too intricate, and - while they aren't cozy - they also aren't super grim, either. \n\n\n\n\nI would also highly recommend Clive Barker's Abarat series:\n- Abarat\n- Abarat: Days of Magic, Nights of War\n- Abarat: Absolute Midnight\n- (books 4 and 5 haven't been released yet)\n\n\nIt's a super whimsical, fever dream of a series. The world building is fascinating, but not terribly complex. Again, neither cozy nor particularly grim.", "Generally I would suggest Terry Pratchett. However, his Disc World novels have both a complex world and lore. They are advertised as being able to be read in any order...but that also makes it kind of overwhelming figuring out where to start and there are definitely inside jokes that are pulled from other novels. \n\n\nI will still suggest Terry Pratchett, because he is amazing, but I'll recommend his YA series instead. It's the Tiffany Aching series or novels. They are technically young adult but I read them as an adult and enjoyed them. ", "The World of the Five Gods series by Lois Macmaster Bujold. Award winning, beautifully written books.\n\nYou can start with Penric's Demon which is a novella.", "Dm me if u need anyone to talk to, and sorry but most fantasy I read either has deep lore or heavy themes but I know you can get through whatever happened", "Johnathan Strange and Mr Norrell by Susanna Clarke.\n\nIt’s an incredibly historical, academic take on fantasy - written in the tradition of Dickens or Austen but from the same itch that drove Tolkien- restoring a lost folklore tradition of England and Britain in what is basically an alternative history. \n\nThe writing is just *so good*, and the world building is done through extensive footnotes that add background to the story in a way that makes it feel so rigorous.\n\nDon’t let the length put you off, I was on page 1000 WISHING I had another 1000 to go.", "Try some lower fantasy Romance. Things like Lana Harper's Thistlegrove series or April Asher's Supernatural Singles series.", "{{Another Fine Myth}}by Robert Aspririn\n\nHas magic, but I feel like it’s somewhat grounded (in the first books, at least", "The warlord chronicles by Bernard cornwell. Set in dark age britian during the Anglo-saxon invasions, the story is told from the pov of derfel an old monk chronicling the tale of Arthur and his part in it.\n\n“These are the tales of the land we call Lloegyr, which means the Lost Lands, the country that was once ours but which our enemies now call England. These are the tales of Arthur, the Warlord, the King that Never Was, the Enemy of God and, may the living Christ and Bishop Sansum forgive me, the best man I ever knew. How I have wept for Arthur”\n\n“But fate, as Merlin always taught us, is inexorable. Life is a jest of the Gods, Merlin liked to claim, and there is no justice. You must learn to laugh, he once told me, or else you’ll just weep yourself to death.”\n\n“I know I have gained Christ and through His blessing I have gained the whole world too, but for what I have lost, for what we have all lost, there is no end to the reckoning. We lost everything”"], "suggested_books": ["The Very Secret Society of Irregular Witches", "The Goblin Emperor", "The Night Circus", "Legends & Lattes", "Spinning Silver", "The Magicians", "The Ten Thousand Doors of January", "The Paper Magician", "Spinning Silver", "The warlord chronicles"], "score": 6, "id": "1jmzbw8", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmzbw8/fantasy_for_a_nonfantasy_reader/"}
{"title": "Cold war era Spy book from Soviet perspective", "body": "Hi,  I like spy books and in general books about the cold war era. Or books set in 1940s-1990s. Books like the spy who came in from the cold, the devil's alternative etc. I'm looking for recommendations of similar fiction books (in English) but written by Russian/Soviet authors from their perspective.  Thanks!", "comments": ["You might try Gorky Park, although it's by an American. I don't think you're going to find many fictional works in this vein that are written by Soviet/Russian authors.", "Child 44 by Tom Rob Smith. It's less of a spy plot, but rather a crime story set in the Stalin era. One of the most thrilling books I have ever read.", "The Spy and the Traitor!\n\nIt’s a true story about the Russian double agent who leaked information for decades, and culminates in a daring escape attempt with his family from Russia \n\nIt’s non-fiction, but is extremely entertaining"], "suggested_books": ["Child 44"], "score": 3, "id": "1jn2ft9", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn2ft9/cold_war_era_spy_book_from_soviet_perspective/"}
{"title": "what's a good true story book?", "body": "give me your best true stories", "comments": ["Endurance by Alfred Lansing", "Unbroken by Laura Hillenbrand", "Educated\n\nRunning with Sherman\n\nboth read like novels", "Midnight in Chernobyl\n\nChallenger\n\nBoth are books by Adam Higginbotham and tell the stories of the Chernobyl disaster, and the Space Shuttle Challenger disaster, respectively.", "Immortal Life of Henrietta Lacks\n\nJust Mercy", "The Glass Castle", "“Say Nothing”. It’s about The Troubles and is riveting. Also turned into a great mini series by Hulu. ", "Empire of Pain.", "The indifferent stars above, fantastic read about the Donner party", "Into Thin Air by Jon Krakauer  \nEndurance by Alfred Lansing  \nThe Right Stuff by Tom Wolfe  \nDestiny of the Republic by Candice Milliard\n\nFor sure these all seem a little male-centric but they can be universally enjoyed."], "suggested_books": ["Endurance", "Unbroken", "Say Nothing", "Endurance", "Destiny of the Republic", "The Right Stuff", "Into Thin Air"], "score": 24, "id": "1jmn6mm", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmn6mm/whats_a_good_true_story_book/"}
{"title": "I really want a novel about reality tv", "body": "I LOVE reality tv (Vanderpump Rules, Love Island, Love is Blind, Survivor, Top Chef, Teen Mom, The Bachelor, Traitors, Drag Race etc), and I have this vision of reading a book that shows like the inner-workings of being on a reality tv show. In my wildest dreams it goes between perspectives of a person being on the show and a person who watches the show.   I don’t know if such a book exists, but I’ll take any suggestions that might align! And if anyone here is a writer and wants to write it, I’ll be your first reader!!", "comments": ["The Family Experiment by John Marrs. Premise is a virtual reality show where contestants raise a child with VR headsets.", "Are you open to nonfiction? If so, *Cue the Sun!* by Emily Nussbaum would be perfect for you.", "Chain-Gang All-Stars by Nana Kwame Adjei-Brenyah\n\nHeavy on the violence but this is easily one of the best books I've ever read", "Dead Famous by Ben Elton is about a Big Brother-style reality show (and a murder).", "Check out Small Game, by Blair Braverman. It follows a woman on a survivalist reality show that goes horribly wrong, and is fantastically suspenseful and fun to read. Although this is her first novel, the author is a dogsled musher and nonfiction writer who herself was a contestant on Naked and Afraid, so she knows what she’s talking about, and it shows. Highly recommended.", "Patricia Wants to Cuddle by Samantha Allen", "The Charm Offensive by Alison Cochrun\n\nIt's an LGBT story that takes place behind the scenes of a Bachelor-like show.", "Rosaline Palmer Takes the Cake by Alexis Hall", "An off-beat one would be the \"Slouch Witch\" books.  She would rather spend all day watching a reality show about people competing with their magic.  In one of the books she ends up as a contestant (the only one who really has magic as the show is all fake).  She quickly learns that they have assigned her a \"type\" and role to play, she's told how to dress and speak, and more.", "I read a book last year called The Real Deal by Caitlin Devlin. \n\nIt was about a fictional reality TV show, showing the lives of teenage girls going through acting/dancing school to become stars. I was hooked on it! Gave it 5 stars!\n\nI also have one on my TBR I haven't read yet called Reality Check by Vicki Notaro.\n\nI love books about fictional famous people!"], "suggested_books": ["The Family Experiment", "Cue the Sun!", "Chain-Gang All-Stars", "Dead Famous", "Naked and Afraid", "Patricia Wants to Cuddle", "The Charm Offensive", "Rosaline Palmer Takes the Cake", "type"], "score": 21, "id": "1jmoalw", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmoalw/i_really_want_a_novel_about_reality_tv/"}
{"title": "Suggest me a book full of atemporal human wisdom", "body": "I want a book that is not related to current events or trends, but one that contains knowledge and life tips and insights that would be useful to any human in history or in the future", "comments": ["Yes, this is such a rich kind of ask—the search for something *evergreen*, something that doesn’t age because it speaks to what it means to be human, not just to live in a particular moment. Here are some books that carry that atemporal, distilled wisdom you’re after:\n\n**1.** ***Meditations*** **by Marcus Aurelius**  \nA timeless internal dialogue from a Roman emperor. It’s not meant to impress—it’s just him wrestling with being decent, focused, and grounded in a chaotic world. Every page reads like a note to self that still holds up two millennia later.\n\n**2.** ***Letters from a Stoic*** **by Seneca**  \nIf *Meditations* feels a bit too clipped or abstract, Seneca is more like having a wise, slightly sarcastic mentor walk you through the inner life. Philosophy blended with practical reminders about time, desire, fear, and meaning.\n\n**3.** ***Tao Te Ching*** **by Lao Tzu**  \nIt’s barely 80 pages, but you can spend a lifetime with it. Each verse is like a finger pointing at truth without trying to nail it down. It doesn’t preach—it invites reflection.\n\n**4.** ***The Prophet*** **by Kahlil Gibran**  \nPoetic, gentle, and piercing. Gibran writes about love, sorrow, parenting, work, and death with a kind of sacred simplicity that hits harder the more life you’ve lived.\n\n**5.** ***The Art of Worldly Wisdom*** **by Baltasar Gracián**  \nA Spanish Jesuit from the 1600s wrote 300 aphorisms on navigating life with clarity and cunning. It’s like a more strategic cousin to *Meditations*—less about inner peace, more about insight and perception.\n\n**6.** ***A Man’s Search for Meaning*** **by Viktor Frankl**  \nWritten after surviving the Holocaust, Frankl’s perspective on suffering, purpose, and freedom of mind is the kind of wisdom that holds weight in any century.\n\nEach of these books operates on a slow frequency—meant to be absorbed in small doses, returned to when life gets loud.\n\nCurious, are you more drawn to poetic insight, practical philosophy, or something in between? That might help unlock a few more obscure gems.", "Tao Te Ching", "Fyodor Dostoevsky. The brothers karamazov.1880. Never been more critical.", "Montaigne's Essays", "Tuesdays with Morrie or The Five People You Meet in Heaven by Mitch Albom", "The Book on the Taboo Against Knowing Who You Are by Alan Watts\n\nWhen Breath Becomes Air by Paul Kalanithi", "Seconded."], "suggested_books": ["evergreen", "Tao Te Ching", "The Art of Worldly Wisdom", "Letters from a Stoic", "The Prophet", "Meditations", "When Breath Becomes Air", "The Book on the Taboo Against Knowing Who You Are"], "score": 8, "id": "1jmv4ss", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmv4ss/suggest_me_a_book_full_of_atemporal_human_wisdom/"}
{"title": "Books set in Mongolia", "body": "I’d like to read some fiction books set in Mongolia, preferably modern Mongolia, better if it’s written by a Mongolian, best if it’s written by a Mongolian woman.", "comments": ["The Blue Sky by Galsan Tsching starts a trilogy of a coming of age story. He's a Tuvan shaman and has published much more, but I haven't read anything else from him yet."], "suggested_books": ["The Blue Sky"], "score": 1, "id": "1jn70xb", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn70xb/books_set_in_mongolia/"}
{"title": "Looking for a collection of short western stories", "body": "Ill be blunt.  I have an uncle that only reads in the bathroom.   He subscribes to readers digest because they have short stores that are only a few pages long.  He was saying a few years back that no one writes wild west or frontier stories in decades  I would love to find a collection of very short stories that I can give him as a gift.   Even if its an old publication that i can still manage to find on the used market.  Let me know if you have any ideas.", "comments": ["I really enjoyed Still Wild - edited by Larry McMurtry.", "Might be a little old even for him, but some of the most famous are The Luck of Roaring Camp and Other Stories and The Outcasts of Poker Flat and Other Stories, both by Bret Harte.", "https://www.thriftbooks.com/w/max-brands-best-western-stories--volume-iii-_max-brand_william-f-nolan/846876/\n\nZane Gray wrote Western short stories as did Max Brand\n\nLook around for collections of either", "Not real short but Jim Harrison has novellas that take place in western US.", "The Complete Western Stories of Elmore Leonard (the man who wrote Three-Ten To Yuma)"], "suggested_books": ["The Luck of Roaring Camp and Other Stories"], "score": 2, "id": "1jn317u", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn317u/looking_for_a_collection_of_short_western_stories/"}
{"title": "Looking for some books for my 10 yr old", "body": "She’s a pretty good reader for her age, some books/series she’s read and loved are Harry Potter, Percy Jackson, Skyward, Aurora Rising, and Alex Rider. Looking for books that she’ll enjoy but might challenge her a little. Was debating Hunger Games. What are some suggestions you have?", "comments": ["I would suggest the Tiffany Aching series by Terry Pratchett, starting with the Wee Free Men. The protagonist ages up with the reader and she's just the right age for the first book. They're funny, action packed, and a little dark as the series moves on. They also deal with the importance of critical thinking, and themes of grieving a lost loved one, finding your place in the world, defying societal expectations for girls, and helping others.\n\n\n\n\nIf you think she'd like a story about a young witch who uses her annoying baby brother as bait so she can beat up an evil fairy with a frying pan, I'd give it a go.", "Redwall series!\n\nStart with Redwall", "Circle of Magic series by Tamora Pierce\n\nSo You Want to be a Wizard by Diane Duane\n\nArtemis Fowl by Eoin Colfer\n\nThe Inkheart trilogy by Cornelia Funke", "Before Suzanne Collins wrote “The Hunger Games” she wrote a series called Gregor the Overlander Series: https://www.goodreads.com/book/show/262430\n\nI enjoyed it as an adult but it is written for the +/-10 year olds", "I'd wait a bit for Hunger Games.\n\nHow about Cornelia Funke's Inkheart trilogy or Robert Muchamore's Cherub series or Michele Paver's Chronicles of Darkness (cave boy stories starting Wolf Brother)?", "Gregor the Overlander series by SUzanne Collins is written for her age group and is awesome.", "The whole *[__The Mysterious Benedict Society__](https://www.amazon.com/Mysterious-Benedict-Society-Paperback-Boxed/dp/0316460966/)* series. So much fun!", "A Little Princess by Frances Hodgson Burnett \n\nThe Secret Garden by Frances Hodgson Burnett \n\nPollyanna by Eleanor H. Porter \n\nPollyanna Grows Up by Eleanor H. Porter \n\nThe Wonderful Wizard of Oz by L. Frank Baum", "- The Inheritance Cycle (Eragon series)\n\n- Hunger Games (I’m reading the newest book now!)\n\n-His Dark Materials by Philip Pullman\n\n- The Giver Quartet by Lois Lowry (The Giver is my favorite book of all time)\n\n- Ender’s Game by Orson Scott Card", "Sounds like she’s right in that sweet spot where she’s craving more depth but still loves a fast-paced, adventurous read. Given what she’s already enjoyed, here are a few that might stretch her a bit without losing the fun:\n\n* *The Hunger Games* is definitely a solid choice if she can handle darker themes. It’s intense but thoughtful, and if she liked the high-stakes strategy in *Alex Rider*, she’ll probably get pulled in fast.\n* *Ender’s Game* by Orson Scott Card might be a leap in complexity, but kids who like tactical thinking and emotional depth often find it unforgettable. It hits harder than it looks at first glance.\n* *The Gilded Wolves* by Roshani Chokshi. Great mix of puzzles, found family, and historical fantasy. It's a bit denser than *Harry Potter* or *Skyward*, so might be a good “next tier” challenge.\n* *Scythe* by Neal Shusterman. Grabs you fast, but it’s also loaded with big ideas about morality and society. Great bridge into more philosophical YA.\n* *The Mysterious Benedict Society* by Trenton Lee Stewart. A little more whimsical, but still clever and layered. Lots of problem-solving and strong emotional payoff.\n\nIf she liked the space sci-fi vibe of *Skyward* and *Aurora Rising*, you could also check out *Illuminae* by Kaufman and Kristoff, though it's more experimental and might feel like a leap, depending on her comfort with mixed-media storytelling.\n\nCurious, what kind of themes or characters does she tend to gravitate toward the most? That might help dial in some hidden gems."], "suggested_books": ["Artemis Fowl", "So You Want to be a Wizard", "The Hunger Games", "The Secret Garden", "A Little Princess", "Pollyanna Grows Up", "Pollyanna", "-His Dark Materials", "- Ender’s Game", "Skyward", "Aurora Rising", "The Gilded Wolves", "Illuminae"], "score": 8, "id": "1jmukx9", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmukx9/looking_for_some_books_for_my_10_yr_old/"}
{"title": "Suggest me a book/series that is thrilling to read for both guys and girls book club", "body": "Hello all! Me and my friends wanted to get into reading this year, and we wanted to read something that was fun for both guys and girls! Though, we are all beginners, so we don't have any knowledge of books that are out that would be good for us!  Some things that we like in a book would be themes of suspense, thriller, plot twists, drama, romance, fantasy, dystopia, murder mystery, great world building, character development.   Not all of these have to be in one book, but these are just elements that we like!  Huge bonus if the book has a pair of star crossed lovers, as one of the readers love that trope haha  We would honestly just love a book that is exciting to read each week and that would create fun discussions and theorizing sessions!   thank you so much! we really are eager to start our journey on reading", "comments": ["I run a book club with some friends, and we are a mix of guys and girls. Here are some we have liked, and some I think you may like:\n\n* Six Wakes by Mur Lafferty. A murder mystery in space.\n\n* Gideon the Ninth by Tamsyn Muir. Very much love-it-or-hate-it. \n\n* I second the recommendation of The Fifth Season by N. K. Jemisin. We had a great, thought provoking discussion after reading this one. \n\n* We also read Circe by Madeline Miller, but had mixed feelings about it overall.\n\n* The Left Hand of Darkness by Ursula K. Le Guin. A great sci fi classic.\n\n* Project Hail Mary by Andy Weir. A very popular, well-liked book\n\n* Babel by R. F. Kuang. We had some great discussions after this one, even though some members didn't like it.\n\n* The Galaxy and the Ground Within by Becky Chambers. This is technically fourth in a series, but it worked as a stand alone. You could also start with the first book, The Long Way to a Small Angry Planet, which has some romance. \n\n* The Snow Queen by Joan D. Vinge. I read this years ago and keep trying to get my book club to read it, but as of yet we've picked different books!\n\n* Red Rising by Pierce Brown. Dystopia, character development, plot twists, and romance. \n\n* Klara and the Sun by Kazuo Ishiguro\n\n* I Who Have Never Known Men by Jacqueline Harpman", "The Ibis trilogy by Amitav Ghosh has everything you mentioned in my opinion.", "The Fifth Season by NK Jemisin or Circe by Madeline Miller might be fun ones! Both books are excellent and were big hits in our book club.", "I second the red rising series by pierce brown. I’m on the 4th book now and am so hooked!", "Seconding Fifth Season (one of my favorites!), Hunger Games might also be fun if you're all newer to reading as it has many of those elements, is relatively fast paced and being young adult won't be too heavy.", "Never Let \n\nMe Go - dystopian \n\nDark Matter\n\nThe Martian (by Project Hail Mary author)\n\nAnxious People\n\nMurder mystery, The Silent Patient \n\nFantasy cozy and charming, The House in the Cerulean Sea (sequel Beyond the Sea)", "I can recommend the JackWest Jr series by Matthew Reilly. Seven book series, starts with The Seven Ancient Wonders. It’s a series that grabs you from the start and doesn’t let up.", "Many classics still have wide appeal. The Three Musketeers or The Count of Monte Cristo. The Master and Margarita. Discworld books."], "suggested_books": ["The Snow Queen", "* Six Wakes", "* Red Rising", "The Left Hand of Darkness", "* Project Hail Mary", "* Klara and the Sun", "* I Who Have Never Known Men", "* The Left Hand of Darkness", "The Long Way", "* The Galaxy and the Ground Within", "* Gideon the Ninth", "* The Snow Queen", "Beyond the Sea"], "score": 7, "id": "1jmvbl3", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmvbl3/suggest_me_a_bookseries_that_is_thrilling_to_read/"}
{"title": "Just finished Man’s Search for Meaning and Thousand Splendid Suns… what should I read next?", "body": "Don’t ask me how i’m doing… but i’m looking for more books in this genre. Something about Frankl and Hosseni’s writing…. It just does something inside. I need more literature that stirs me the same way. Please send help. Also, thoughts on Before the Coffee gets cold by Kawaguchi?", "comments": ["The Kite Runner, The Book Thief, When Breath Becomes Air.", "Both of those are such powerful reads. Hope you find another one that resonates just as deeply!", "*Human Acts*, Han Kang.\n\n*Martyr!*, Kaveh Akbar.\n\n*Beloved* and *The Bluest Eye*, Toni Morrison (if you've yet to read Morrison).\n\n*Pachinko*, Min Jin Lee.", "Chimamanda Ngozi Adichie: Half of a Yellow Sun", "Night by Elie Wiesel"], "suggested_books": ["Pachinko", "The Bluest Eye", "Human Acts", "Martyr!", "Beloved"], "score": 9, "id": "1jmsid9", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmsid9/just_finished_mans_search_for_meaning_and/"}
{"title": "Books on the rise of the alt-right and antifeminism", "body": "Has anyone written any good books recently on the worrying rise of these reactionary attitudes in the west?", "comments": ["Black Pill x Elle Reeve", "Men Who Hate Women by Laura Bates", "Kill All Normies: Online Culture Wars from 4chan and Tumblr to Trump and the Alt-Right", "Doppelganger by Naomi Klein", "I have a feeling that many of the suggestions on this thread are focused mainly on the grievances of the right and probably couch those grievances in unsympathetic terms. I'd suggest reading The Rise and Fall of the Neoliberal Order to understand why so many people in this country have grievances and why the root of those grievances might have some logic.\n\nFor those unfamiliar, \"Neoliberal\" does not necessarily imply \"Liberal\" in the American political sense. Arguably, the US political landscape was solidly Neoliberal from 1980 to 2016, from Reagan to Obama. \n\nThe book's central argument is that that era's globalist, free-market policies made everything seem great for one subset of our country while being a net negative for another subset. The former subset was better represented in popular culture, which gave the impression that America was improving for everyone. Furthermore, the latter subset lived in areas and had jobs that were not considered \"desirable,\" so their losses were easy to shrug off as \"progress.\"\n\nThis led to a massive backlash against both Republicans and Democrats (remember, both parties were Neoliberal) and allowed a third political movement to take over the Republican Party. As the book details, some of the foundational concerns of that movement were valid, but any movement based purely on grievance is a magnet for people who try to stoke fears and divisions.", "Both of Talia Lavin’s books, Blind Faith and Culture Warlords, are excellent and get to different aspects of the alt-right and antifeminism.", "\"Meme Wars: The Untold Story of the Online Battles Upending Democracy in America\" by Brian Friedberg, Emily Dreyfuss, and Joan Donovan.\n\nGood stuff.", "The Power Worshippers, Antisocial, Culture Warlords, Wild Faith, It Came From Something Awful, The Rage of Replacement, Jesus and John Wayne, When the Clock Broke, Trust the Plan, The Storm is Upon Us are all in that direction and tell important parts of the story.\n\nThe aforementioned Black Pill and Men Who Hate Women are also excellent recs.", "[Crash Overide by Zoe Quinn](https://www.goodreads.com/book/show/28251812-crash-override) is a really good explanation of how the online tech bro red pill nonsense spread into real life.", "Invisible Women by Caroline Criado Perez"], "suggested_books": ["Men Who Hate Women", "Doppelganger", "Neoliberal", "Meme Wars: The Untold Story of the Online Battles Upending Democracy in America", "\"Meme Wars: The Untold Story of the Online Battles Upending Democracy in America\"", "Invisible Women"], "score": 9, "id": "1jmtfl7", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmtfl7/books_on_the_rise_of_the_altright_and_antifeminism/"}
{"title": "Recent children’s/juvenile literature worth reading as an adult?", "body": "I’m interested in fully rounding out my library with children/juvenile literature.   I have most of the classics like Anne of Green Gables, A Little Princess, etc.   I also have some of the books that are from my own childhood and YA years like A Series of Unfortunate Events, Harry Potter, Hunger Games, Shadowhunters, and Twilight (not particular great literature, but gives you an idea of the time frame I was reading this genre regularly).   But I have no idea what has been released semi-recently (within the last 15 ish years, I would say) since I’ve stopped reading in those genres as much as before.   What other books aimed at a younger audience is still worth reading as an adult? It can be something that simply also appeals to an adult audience (like Series of Unfortunate Events) or where the story is just so interesting, it pulls you in (a general theme in YA, to be honest)   So what’s out there now?", "comments": ["Angie Thomas's The Hate U Give\n\nThe Gentleman's Guide to Vice and Virtue by Mackenzi Lee - the whole series really.\n\nOne of Us  series by Karen M. McManus\n\nNeal Shusterman's  Scythe series", "Not necessarily \"literary,\" but all of the following are very well-written, have engaging plots and characters, and were highly enjoyable reads though I am certainly no longer in the target age range:\n\n\n\n\n- The Small Spaces series by Katherine Arden\n- The Lockwood & Co. Series by Jonathan Stroud\n- The Depths by Nicole Lesperance\n- The Night Gardener by Jonathan Auxier\n- The City of Ghosts series by Victoria Schwab", "Every Heart a Doorway by Seanan McGuire\n\nLips Touch: Three Times by Laini Taylor\n\nA Deadly Education by Naomi Novik\n\nMooncakes by Suzanne Walker\n\nThe Cruel Prince by Holly Black\n\nStrange the Dreamer by Laini Taylor\n\nThe Girl Who Circumnavigated Fairy Land in a Ship of Her Own Making by Catherynne M. Valente\n\nSix of Crows by Leigh Bardugo\n\nTaproot by Keezy Young\n\nAristotle and Dante Discover the Secrets of the Universe by Benjamin Alire Saenz\n\nLore of the Wilds by Analeigh Sbrana\n\nThe Gentleman’s Guide to Vice and Virtue by Mackenzi Lee\n\nAn Ember in the Ashes by Sabaa Tahir\n\nWhere the Dark Stands Still by AB Poranek", "It’s marketed as a kids book but it’s really for all ages: The Eyes and the Impossible by Dave Eggers. Beautifully written story about a dog who lives in a big park and has a very important job.", "A trilogy by K. E. Ormsbee: \"The Water and the Wild\", \"The Doorway and the Deep\", \"The Current and the Cure\".  Hot dang do I wish these had been around when I was a kid. But I thoroughly enjoyed them as an adult. Genre is fantasy, in a Narnia sort of way. Lovely and unique characters and world-building. Ormsbee doesn't shy away from some of the darker stuff that kids/adults experience but I wouldn't say these books are \"dark\".  I love this author - she is whimsical, inclusive, and her characters are so, so excellently written.", "Minor Mage by T. Kingfisher (pen name of Ursula Vernon) is a strange, fantastic and captivating little book; I can't recommend it highly enough. \n\nAlso, I'll throw in some votes for older books that are very much worth the read, that may not have made it onto your radar. Mrs. Frisby And The Rats Of NIMH is one that I had to read in elementary school, and it was a fairly old book then. You might have this one, I know it maintains a cult following partially because of the movie, but I wanted to throw it in because I recently did a reread and got so much more out of it than I did as an 11-year-old in a boring reading group. On the other hand, The Thief Lord by Cornelia Funke has never seemed to be as popular as it deserves to be. This book practically grew with me; I reread it dozens of times over the years and it hits different every time. For an adventure story, it has some deep thoughts about what it really means to grow up.", "This is on the edge of the window you gave (published 2009), but if you haven’t read it, When You Reach Me by Rebecca Stead is really fantastic.\n\nThe Girl Who Drank the Moon by Kelly Barnhill \n\nThe Lie Tree by Frances Hardinge\n\nMidwinterblood by Marcus Sedgwick\n\nDig by AS King\n\nHello, Universe by Erin Entrada Kelly", "I'm in my 50s and love good MG literature.  Some recent (and lesser known) titles I really enjoyed:\n\n- \"The Extremely Inconvenient Adventures of Bronte Mettlestone\" by Jaclyn Moriarty (whimsical fantasy),  \n- \"The Probability of Everything\" by Sarah Everett (speculative fiction/family/racism - best read cold, avoiding risk of spoilers),  \n- \"Better With Butter\" by Victoria Piontek (mental health/anxiety),  \n- \"Small Spaces\" by Katherine Arden (horror/mystery - I'm not usually into horror but this was very well done and really creepy)\n\nAnd I'll add one of my all-time old favourites: \"When You Reach Me\" by Rebecca Stead (SF/mystery)", "Thank you so much! This is exactly what I have in mind. Something well written and engaging."], "suggested_books": ["The Gentleman's Guide to Vice and Virtue", "The Night Gardener", "- The Night Gardener", "Every Heart a Doorway", "A Deadly Education", "Strange the Dreamer", "The Cruel Prince", "Aristotle and Dante Discover the Secrets of the Universe", "Six of Crows", "Lore of the Wilds", "Mooncakes", "Taproot", "An Ember in the Ashes", "The Gentleman’s Guide to Vice and Virtue", "The Water and the Wild", "The Doorway and the Deep", "The Current and the Cure", "The Thief Lord", "Hello, Universe", "The Lie Tree", "Midwinterblood", "The Girl Who Drank the Moon", "Small Spaces", "- \"Better With Butter\"", "- \"The Extremely Inconvenient Adventures of Bronte Mettlestone\"", "- \"Small Spaces\"", "When You Reach Me", "Better With Butter", "The Extremely Inconvenient Adventures of Bronte Mettlestone"], "score": 2, "id": "1jn1wds", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn1wds/recent_childrensjuvenile_literature_worth_reading/"}
{"title": "Seeking a book for self worth and depression..", "body": "I’m on a journey where I can’t just sit and do nothing anymore. I’m looking for a good read for an individual struggling with self worth/love and depression.", "comments": ["Siddhartha by Hermann Hesse", "Hyperbole and a Half by Allie Brosh", "Tiny beautiful things by Cheryl Strayed. Many inspiring short essays in and advice column style. Lots to process in this little book.", "Mind over Mood is a workbook that will help a person become less depressed. I have used it for close to 25 years!", "The Mindful Self Compassion Workbook by Kristin Neff\n\nChatter by Ethan Kross\n\nOvercoming Unwanted Intrusive Thoughts by Sarah M. Winston\n\nRetrain Your Brain by Seth J. Gillihan\n\nYou Will Get Through This Night by Daniel Howell\n\nThe Upward Spiral by Alex Korb \n\nThe Self Esteem Workbook by Glenn R. Schiraldi", "The Noonday Demon by Andrew Solomon.", "Radical self compassion by Tara Brach helped me… funny because I also recommended it in another thread. Haven’t read it in awhile but it was seminal for me when I first started therapy."], "suggested_books": ["Siddhartha", "Hyperbole and a Half", "Tiny beautiful things", "Overcoming Unwanted Intrusive Thoughts", "You Will Get Through This Night", "The Upward Spiral", "The Self Esteem Workbook", "Chatter", "Retrain Your Brain"], "score": 1, "id": "1jn5855", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn5855/seeking_a_book_for_self_worth_and_depression/"}
{"title": "Books for someone fighting to love themself", "body": "Maybe a little history would help.   40/m. Second marriage. 2 kids.  5 years in recovery for alcohol.  Anxiety/Depression/ADHD.  Chronic infidelity.  Looking into SLAA.   Recently discovered a lot of my issues have to deal with my parents not showing affection/making me feel cared about/loved, etc.   I’m working with a new therapist and the real goal is to focus on myself, getting to know who I am and actually liking the person I am, rather than hating myself. I feel like I got a long road to go and half of my life is already over.   I’m completely open to any suggestions you all may have. Thank you.", "comments": ["First, just want to say—it takes real strength to face all this head-on and *still* be willing to work on yourself. That mindset alone puts you in rare company. You're not starting from zero. You're starting from self-awareness, which is half the battle most people never even fight.\n\nHere are a few books that have helped a lot of people walk the same kind of path you're on:\n\n**1.** ***Homecoming*** **by John Bradshaw**  \nThis one hits deep if you're dealing with childhood emotional neglect. It walks through reconnecting with your inner child and gives you tools to begin healing those invisible wounds. Powerful without being preachy.\n\n**2.** ***No Bad Parts*** **by Richard Schwartz**  \nThis introduces Internal Family Systems (IFS), a therapeutic model that teaches you to see yourself not as broken, but as made of “parts” that all had a reason for existing. Especially helpful if you’ve struggled with shame or self-sabotage.\n\n**3.** ***The Body Keeps the Score*** **by Bessel van der Kolk**  \nA modern classic. It’s about how trauma, big or small, lives in the body—and how to work with it instead of against it. Some chapters are heavy, but it gives language to things a lot of us never knew how to describe.\n\n**4.** ***Untamed*** **by Glennon Doyle**  \nThis one may seem unexpected, but if you want a voice that says \"you’re allowed to rebuild everything from scratch\" with vulnerability and grit, this hits. It’s not just for women—it's for anyone tired of pretending.\n\n**5.** ***Healing the Shame that Binds You*** **by John Bradshaw**  \nSince you’re diving into SLAA and recovery from infidelity, this one might be especially useful. It breaks down how shame drives compulsive behaviors and how to dismantle that cycle.\n\nYou said half your life feels like it's over, but here's the truth: everything you're doing now? Most people never get there, *ever*. If anything, this is the beginning of your real life. Messy, honest, and yours.\n\nAre you more drawn to books that offer frameworks and tools, or ones that feel like someone walking beside you and speaking truth you didn't know you needed to hear? That might help tailor more recs your way.", "The Mindful Self Compassion Workbook by Kristin Neff\n\nThe Self Esteem Workbook by Glenn R. Schiraldi\n\nEvery Memory Deserves Respect by Deborah Korn\n\nChatter by Ethan Kross\n\nOvercoming Unwanted Intrusive Thoughts by Sarah M. Winston\n\nThe Journey From Abandonment to Healing by Susan Anderson\n\nTrue You: A Self Discovery Journal by Dr. Kelly Vincent\n\nThe Adverse Childhood Experiences Recovery Workbook by Glenn R. Schiraldi\n\nAll About Love by bell hooks\n\nHow to Meet Yourself by Dr. Nicole LaPera\n\nThe Self Discovery Journal by Dr. Yana Lechtman\n\nSelf Talk Guided Journal by Liz Oncel\n\nRetrain Your Brain by Seth J. Gillihan\n\nThe Upward Spiral by Alex Korb\n\nSecurely Attached by Eli Harwood\n\nIt Didn’t Start With You by Mark Wolynn\n\nOn Repentance & Repair by Danya Ruttenberg \n\nAdult Children of Emotionally Immature Parents Guided Journal by Lindsay C. Gibson, PsD\n\nBreaking the Cycle of Abuse by Beverly Engel\n\nThe Book You Wish Your Parents Had Read by Philippa Perry\n\nEmpathy by Roman Rznaric\n\nBorn For Love by Maia Szalavitz", "If Christian books are acceptable, I love The Ragamuffin Gospel and Abba’s Child by Brennan Manning", "Thank you so much for this message. It means more than you know. 🥹\n\nRegarding your question at the end pertaining to a certain type of book, I really have no preference. I’m trying to be completely open to whatever is out there that may help me on my way.", "Wow. This will keep me busy for a while! Any you would recommend starting with?", "Everything is acceptable! Thank you.", "Maybe Overcoming Unwanted Intrusive Thoughts or Chatter?"], "suggested_books": ["Healing the Shame that Binds You", "No Bad Parts", "Homecoming", "The Body Keeps the Score", "Breaking the Cycle of Abuse", "Every Memory Deserves Respect", "The Self Discovery Journal", "The Upward Spiral", "Self Talk Guided Journal", "On Repentance & Repair", "How to Meet Yourself", "Born For Love", "Adult Children of Emotionally Immature Parents Guided Journal", "Retrain Your Brain", "Overcoming Unwanted Intrusive Thoughts", "Securely Attached", "The Book You Wish Your Parents Had Read", "It Didn’t Start With You", "The Self Esteem Workbook", "Empathy", "Chatter"], "score": 4, "id": "1jmusso", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmusso/books_for_someone_fighting_to_love_themself/"}
{"title": "Best reacher books", "body": "Love the reacher show, reading 61 hours, loving it. What's a few other of the good ones of reacher books to read?", "comments": ["If you're loving *61 Hours*, you're already in one of the stronger arcs. That one leads directly into *Worth Dying For*, which is a must-read next since it picks up right where *61 Hours* leaves off.\n\nSome of the other high points in the series:\n\n* *Bad Luck and Trouble* has a great \"Reacher assembles the squad\" vibe. If you liked the camaraderie in the show, this one's gold.\n* *The Enemy* is a prequel and shows Reacher in his MP days. Very different flavor but tight and smart, almost like a procedural with real weight.\n* *Persuader* is a fan favorite for a reason. Reacher goes undercover, and it’s got some of the most brutal tension in the series.\n\nWhat’s cool with Reacher books is you can bounce around since most are standalone. But yeah, a few of them hit harder when you’re on a streak. Curious, what’s been your favorite moment from *61 Hours* so far?", "Earlier the better IMO, I gave up after the hand-over to Andrew.", "Currently at the part where he's watching the house during the prison riot but god just the way it's so matter of fact, I'm loving it. I actually planned on getting the next couple after because I read the plot and how it leads to Amanda so I'm very interested", "Interesting, why?", "I don't think he is nearly as good a writer as his brother. Most series decline over time, the author gets bored but keeps churning them out to the formula as long as they sell or until they're so rich they can say no or just license their name."], "suggested_books": ["61 Hours", "Worth Dying For"], "score": 4, "id": "1jmupt2", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmupt2/best_reacher_books/"}
{"title": "A mystery, suspense, action, thriller, and/or horror with a disabled or differently abled protagonist.", "body": "I saw a movie recently where the protagonist had a disability and showed the precautions he had to make to allow him to survive both in his everyday life and later when he was attempting to rescue someone. It also showed how he was able to use to disability as an advantage.   I’m curious now if there are books with characters who have what appears to be a disability but end up helping them survive. Whether that’s a physical problem like blindness, deafness, amputation, or mental like autism, ocd, or something like that.", "comments": ["Comoran Strike in the series by Robert Galbraith had a leg amputated due to an explosion.  It comes up quite a bit in the books.  The difficulty he has getting around, following suspects, just daily life is all in the books.", "Duma Key by Stephen King\n- Protagonist Edgar Freemantle loses an arm and suffers a traumatic brain injury in a trerrible construction site accident. The story not only follows the process of his recovery, but also examines how his brain injury - and a literal phantom limb - open him up to sinister forces that have long long been sleeping. ", "The Dentist by Tim Sullivan is the first book in his DS Cross series. This is a British police procedural whose main character, DS Cross, has autism spectrum disorder. Not an action-packed thriller but a really good mystery and the story is so interesting about how this different detective solves the crime."], "suggested_books": ["Duma Key", "The Dentist"], "score": 3, "id": "1jmw26m", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmw26m/a_mystery_suspense_action_thriller_andor_horror/"}
{"title": "I desperately need this specific type of a detective-horror book", "body": "i haven't read that many detectives so im open to any suggestions. i need a detective book that has body horror/horror in general elements, like softcore gore, but without the supernatural stuff. i really want to read about human made horrors beyond comprehension that make you get chills, like, the unexplailable mystery has to be created by humans. like the things you'd hear in true crime stories about cannibals, but i can't enjoy true crime no matter how twisted and interesting the story is. i need fiction. also i heavily dislike romance in the same bottle with horror unless its queer and isn't all up in your face so yeah", "comments": ["There would be some short stories/novellas in The Weird, edited by VanDerMeer. Specifically, *The Botherhood of Mutilation*, by Erikson. If nothing else, the list of authors would give you a jumping off point.", "*All the Sinners Bleed* by SA Cosby", "Persona by Vincent Kane. Contains body Horror, Detective stuff, a very intriguing read.", "thank you sm!!! a starting point is just as good 🙏", "the brotherhood of mutilation got turned into a whole novel ! Last Days by Brian Evenson 100% fits the bill of what yr lookin for", "Cool!"], "suggested_books": ["All the Sinners Bleed"], "score": 3, "id": "1jmxs8o", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmxs8o/i_desperately_need_this_specific_type_of_a/"}
{"title": "non-fiction books that encourage you to dream big and show you how to do it", "body": "i’ve been having trouble mustering up hope lately, and i felt a little spark come back to life within me and i want to keep it going. are there any books that give you actionable ways to understand what you want from life and shift your habits to match your desired trajectory?", "comments": ["If you are a creative person, I have heard The Artist’s Way by Julia Cameron is inspiring", "*Getting Things Done* by David Allen\n\n*Do Over* and *Finish* by Jon Acuff\n\n*Rejection Proof* by Jia Jiang", "\"Room to Dream\" by David Lynch and Kristine McKenna is one of the most inspiring books I've ever read, as was Jim Henson's biography by Brian Jay Jones.", "\"The Magic of Thinking Big\" by David J. Schwartz", "Hidden Potential by Adam Grant"], "suggested_books": ["The Artist’s Way", "Do Over", "Rejection Proof", "Getting Things Done", "\"Room to Dream\"", "Room to Dream", "The Magic of Thinking Big", "\"The Magic of Thinking Big\"", "Hidden Potential"], "score": 3, "id": "1jmxo4n", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmxo4n/nonfiction_books_that_encourage_you_to_dream_big/"}
{"title": "Light hearted book with some meat", "body": "Our book club is in a slump. The last books we’ve read have either been so boringly slow with such little plot that I’ve DNFed them or included a male character that is physically or mentally abusive.   We need to lighten it up and will keep our attention.—- For example, I just personally read Stephanie Plums 30th book which was the light we’re looking for, but the storyline is to prescriptive to be something the club would enjoy.   Any recommendations??? Bonus points for fantasy. -100 points for toxic male characters.", "comments": ["Remarkably Bright Creatures - Shelby van Pelt\n\nThe House in the Cerulean Sea - TJ Klune\n\nMary Jane - Jessica Anya Blau\n\nThe Sweet Spot - Amy Poeppel\n\nThe Very Secret Society of Irregular Witches - Sangu Mandanna", "Give Becky Chambers a look. She writes sci-fi, not fantasy, but it conveys a very hopeful view of the world. Either *Long Way to a Small, Angry Planet* or *Psalm for the Wild Built* are great choices.", "Nothing to See Here by Kevin Wilson (there is a male character, if you are anything like me, you really won't like by the end, but the story is not about him so hopefully you'll give it a chance)"], "suggested_books": ["Long Way to a Small, Angry Planet", "Psalm for the Wild Built", "Nothing to See Here"], "score": 1, "id": "1jn4fej", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn4fej/light_hearted_book_with_some_meat/"}
{"title": "I need new books", "body": "So basically, I want books that will emotionally destroy me, not necessarily because the theme/plot is sad but because I’ll love the characters and story and just feel their emotions too.   I mostly read fantasy so I would like recommendations to stick to that, and just to put examples of what I mean in the type of books I’m looking for: Spoilers ahead for the following books: Onyx Storm, Shades of Magic trilogy, the Life of Addie LaRue, Under the whispering door, Mistborn era1  Onyx Storm destroyed me because of how attached I’m to the MMC because of what he goes through even if the story isn’t inherently sad, same thing for Kell in the second book of shades of magic.  The ending of Addie LaRue wrecked me as did the ending of UWD.  The last book of Mistborn absolutely destroyed me with the characters’ ends and everything they went through too!  This are some of the most recent books I’ve read that have truly left me with an ache whenever I’ve read them or think about them so I’m looking for similar stories!", "comments": ["“The Priory of the Orange Tree” for high fantasy, “Someone to Build a Nest In” for dark romantasy. Both incredibly queer!", "Anne Bishop Black Jewels series (trigger warning)", "Fairy tale Stephen King", "If you're okay with sex jokes and an insane MC, The Perfect Run by Maxime J. Durand\n\nAlso, Mother of Learning by Domagoj Kumaic. It's a four book series with a wild plot and great characters.\n\nBoth series are insanely good.", "Try The Broken Empire trilogy by Mark Lawrence, The Poppy War by R.F. Kuang, or The Green Bone Saga by Fonda Lee. All have deep character attachment and emotional devastation.", "The Broken Empire trilogy by Mark Lawrence is recommended", "I’ve been interested in The Priory of the Orange Tree, maybe this is a sign to buy it at last! Haven’t heard about the second one though, I’ll check it out. Thanks!"], "suggested_books": ["The Priory of the Orange Tree"], "score": 1, "id": "1jn3grc", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn3grc/i_need_new_books/"}
{"title": "Looking for books about willpower, determination, motivation etc. Fiction and non-fiction", "body": "Basically what the title says. I want to work on my character and personal competency and willpower and motivation is a part I want to really hone in. Any help is greatly appreciated.", "comments": ["The Power of the Now by Eckhart Tolle (Non Fiction) & The Hedeby Trials by Vincent Kane (Fiction)", "Can’t Hurt Me and Never Finished both by David Goggins", "Sun and Steel", "ACT Made Simple: An Easy-to-Read Primer on Acceptance and Commitment Therapy", "Atomic Habits"], "suggested_books": ["The Power of the Now"], "score": 2, "id": "1jmyqai", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmyqai/looking_for_books_about_willpower_determination/"}
{"title": "Books that I can acquire from my library", "body": "Looking for trad published novel recs that I can hopefully check out from my library. My preferred genres are scifi, fantasy, and horror. Will read romance, historical, nonfiction (including true crime), literary, classics, light novels, thriller, and mystery though. Middle grade and young adult is also okay. Bonus points if it’s translated, lgbtq+, fungus related or features a robot/ai.  Things I dislike in books: cozy fantasy, high spice, pregnancy.  Not looking for novellas, graphic novels, manga, self published or indie published. My library doesn’t buy self or indie pub sadly.   I'm planning to only read these books physically so if you think the audiobook is the best route you can recommend it but state so or call it a bonus rec.", "comments": ["Fantasy - In the lives of puppets by TJ Klune - LGBT, funny, great world, and robots. Excellent, I bawled. It’s in my library - medium-large-ish city so crossed my fingers for you.", "Light From Uncommon Stars by Ryka Aoki\n\nThe Tainted Cup by Robert Jackson Bennett\n\nEntangled Life by Merlin Sheldrake\n\nSomeone You Can Build a Nest In by John Wiswell\n\nBoyfriend Material by Alexis Hall\n\nThe Gentleman’s Guide to Vice and Virtue by Mackenzi Lee\n\nMortal Follies by Alexis Hall\n\nTo Shape a Dragon’s Breath by Moniquill Blackgoose\n\nA Psalm for the Wild Built by Becky Chambers\n\nLast Night at the Telegraph Club by Malinda Lo\n\nThe Fireborne Blade by Charlotte Bond\n\nA Closed and Common Orbit by Becky Chambers (can be read as a standalone)\n\nSilver in the Wood by Emily Tesh\n\nThe Obsidian Tower by Melissa Caruso\n\nBinti by Nnedi Okorafor\n\nOnce Upon a Tome by Oliver Darkshire\n\nWinter’s Orbit by Everina Maxwell\n\nThe Art Thief by Michael Finkel\n\nHow to Behave Badly in Elizabethan England by Ruth Goodman\n\nMudlark by Lara Maiklem\n\nCaveat Emptor by Ken Perenyi", "Klara and the sun (AI)\nEvocation (queer)\nThis is how you lose the time war (queer) \nCemetery boys (queer)\nNeuromamcer (sci-fi, ai) \nA Tast of gold and iron (queer)", "I run an indie press but we can’t afford to print enough hard copies for libraries but we do have the ebook version in a few library websites. \n\nJust an alternative if you’re so inclined. Our debut novel is a romance with some grounded sci fi. It’s called A Million Tomorrows by Kris Middaugh if you’re interested.", "I’ve been eyeing that one for a while so thank you for moving it up my tbr.", "Thank you for the recs! Added Mortal Follies to my tbr.", "Thanks for the recs! I’ve added Klara and the Sun and neuromancer to my tbr. Sadly, my library doesn’t have the later but I’ll keep an eye out for it.", "Never Let Me Go, The Remains of the Day, and Klara and the Sun share the same general theme. I found it interesting to see how Ishiguro developed it in each of the books."], "suggested_books": ["A Psalm for the Wild Built", "Entangled Life", "Light From Uncommon Stars", "A Closed and Common Orbit", "Once Upon a Tome", "Winter’s Orbit", "The Tainted Cup", "The Gentleman’s Guide to Vice and Virtue", "Silver in the Wood", "Mortal Follies", "The Art Thief", "Someone You Can Build a Nest In", "Mudlark", "Binti", "How to Behave Badly in Elizabethan England", "Caveat Emptor", "To Shape a Dragon’s Breath", "Last Night at the Telegraph Club", "Boyfriend Material", "The Remains of the Day"], "score": 0, "id": "1jn2y8u", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn2y8u/books_that_i_can_acquire_from_my_library/"}
{"title": "Nonfiction True Crime Books", "body": "I read \"Outrageous Conduct\" and really liked how detailed it was, without coming off as pretentious - i.e. use of big words, just reporting of the facts in a simple, easy to understand manner that was also very thrilling. Are there any other books like that, whether it be true crime or just history?", "comments": ["In Cold Blood. Devil In the White City. People Who Eat Darkness.", "If *Outrageous Conduct* hit the sweet spot for you—clean, gripping, fact-first storytelling without the academic fluff—there are definitely others that deliver that same straight-cut adrenaline.\n\nHere are a few that stay grounded in *accessible intensity*:\n\n**1.** ***Midnight in the Garden of Good and Evil*** **by John Berendt**  \nReads like fiction, but it’s all true. A murder in Savannah, but the real draw is the cast of eccentric characters and the quiet unraveling of a community. Berendt doesn’t try to dazzle you with language, just immerses you in the weird and real.\n\n**2.** ***The Journalist and the Murderer*** **by Janet Malcolm**  \nA fascinating look at ethics in true crime journalism itself. Very lean writing, razor-sharp, and weirdly meta—it asks whether journalists can ever truly report \"just the facts.\"\n\n**3.** ***Columbine*** **by Dave Cullen**  \nExtremely well-researched, calm in tone but thorough in detail. Cullen cuts through the myths and media spin to lay out what really happened, and how we got so much of it wrong. Doesn’t sensationalize but *still* chilling.\n\n**4.** ***Say Nothing*** **by Patrick Radden Keefe**  \nTechnically history, but it reads like a thriller. It's about a murder during the Troubles in Northern Ireland, and it’s got that same clean, gripping tone. Keefe’s storytelling is surgical and compelling without being bloated.\n\n**5.** ***Hell’s Angels*** **by Hunter S. Thompson**  \nBefore he went full gonzo, Thompson just... reported. This one’s gritty and precise, with just enough wild energy to keep it electric.\n\nIf you're open to expanding into well-told investigative journalism, there are also some phenomenal longform pieces (like those in *The Atlantic* or *ProPublica*) that hit a similar note. Want recs in that lane too?", "Any book by Harold Schechter.", "Trailed by Mathryn Miles\n\nI Know Who You Are by Barbara Rae-Venter\n\nThe Stranger in the Woods by Michael Finkel\n\nThe Feather Thief by Kirk Wallace Johnson\n\nThe Foundling by Paul Joseph Fronczak", "The Art Thief by Michael Finkel", "I saw Devil in the White City at Barnes and Noble, I'll have to check it out"], "suggested_books": ["Columbine", "Hell’s Angels", "Outrageous Conduct", "Midnight in the Garden of Good and Evil", "Say Nothing", "The Journalist and the Murderer", "just the facts.", "The Stranger in the Woods", "The Feather Thief", "I Know Who You Are", "The Foundling", "The Art Thief"], "score": 3, "id": "1jmvglq", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmvglq/nonfiction_true_crime_books/"}
{"title": "Mystery/thriller set in a national park?", "body": "Super specific, I know. But the theme for my book club this month is to read a book set in or about a national park (fiction or non-fiction). My mom is looking for something that’s a mystery or thriller that would fit the topic. She’s not a big reader, but is getting there thanks to the book club! Anyway, we’re having trouble finding a book that sounds good for her, and mystery/thrillers are usually a good bet! Thanks!", "comments": ["The Anna Pigeon books by Nevada Barr are mysteries mostly set in national parks. The heroine is a forest ranger.", "Flight Risk by Cherie Priest. It's technically the second in a series but you don't really need to read the first to read the second.", "Check out the “Glacier Mystery” series by Christine Carbo. Great audiobooks performed by the masterful RC Bray", "Boundary Waters by William Kent Kruger\n\nNot quite a national park but a federally designated wilderness area of 1 million acres. It's adjacent to a Canadian Provincial park and Voyagers National Park.", "The Girl who Loved Tom Gordon by Stephen King is set in the White Mountains National Forest. \n\n>On a six-mile hike on the Maine-New Hampshire branch of the Appalachian Trail, nine-year-old Trisha McFarland quickly tires of the constant bickering between her older brother, Pete, and her recently divorced mother. But when she wanders off by herself and then tries to catch up by attempting a shortcut, she becomes lost in a wilderness maze full of peril and terror.\n\n>As night falls, Trisha has only her ingenuity as a defense against the elements, and only her courage and faith to withstand her mounting fears. For solace, she tunes her Walkman to broadcasts of Boston Red Sox baseball games and follows the gritty performances of her hero, relief pitcher Tom Gordon. And when her radio's reception begins to fade, Trisha imagines that Tom Gordon is with her - protecting her from an all-too-real enemy who has left a trail of slaughtered animals and mangled trees in the dense, dark woods...", "The Colton Shaw books by Jeffrey Deaver usually have some massive outdoorsy bits in them, and they rip along pretty quickly."], "suggested_books": ["Flight Risk", "Glacier Mystery", "Boundary Waters", "The Girl who Loved Tom Gordon"], "score": 2, "id": "1jmxyt6", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmxyt6/mysterythriller_set_in_a_national_park/"}
{"title": "help my dad find books to read", "body": "so my dad was complaining about not finding any more books he likes, he couldn’t point to any genres or tags. His favorite authors are T.C. Boyle and Ian McEwan. He also likes William Gibson and Game of Thrones. Maybe you guys have any recommendations of similar authors or books?  Thank you :)", "comments": ["Hmm, he might like John Irving- I’d recommend *A Prayer for Owen Meany*.\n\nOn the more speculative / sci-fi side - he might like *The Anomaly* by Hervé Le Tellier", "Shōgun by James clavell"], "suggested_books": ["The Anomaly", "A Prayer for Owen Meany", "Shōgun"], "score": 2, "id": "1jmxw4h", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmxw4h/help_my_dad_find_books_to_read/"}
{"title": "What is one book that you come back to time and time again?", "body": "I’m so curious to know what yours is. It could be a comfort read that feels like being wrapped in a warm blanket every time you pick it up, or one that reveals something new each time you read it.   Mine is To Kill a Mockingbird. I must have read it 6 or 7 times. I find a new depth or something new to love in the characters each time I read it.   What’s yours?  Edit: Wow! What an incredible response! I’ve tried to reply to as many as I can but I’m reading all the suggestions and creating an epic TBR!", "comments": ["The Count of Monte Cristo.", "Jane Austen. Either Pride and Prejudice or Persuasion.", "*Piranesi* by Susanna Clarke. I just love getting lost in the house and discovering new details each time I reread it :)", "The Hobbit! First read it as a kid and always fall into the magic of it and the appeal of the anxious little homebody Bilbo on his grand epic journey.", "Lord of the Rings. I’ve read it once a year or more for over 40 years.", "Fannie Flagg's books\n\nLM Montgomery's books\n\nLark Rise to Candleford by Flora Thompson", "I love Ayla from Clan of the Cave Bear. She’s such a bad ass! It’s a thick book and I’ve probably read it 5 times.", "Shogun- James Clavell", "Starship Troopers by Robert A. Heinlen\n\nCrptonomicon by Neal Stephenson\n\nSlaughterhouse-Five by Kurt Vonnegut", "It used to be American Gods & Good Omens 🙃"], "suggested_books": ["*Piranesi*", "Piranesi", "Lark Rise to Candleford", "Starship Troopers", "Slaughterhouse-Five"], "score": 254, "id": "1jm46sv", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jm46sv/what_is_one_book_that_you_come_back_to_time_and/"}
{"title": "Books that help navigate challenging times in life", "body": "Hi everyone, I'm currently feeling a little lost. Last year I llost my niece and mom within a couple of weeks of reach other. Pressures from my job are increasing, and last month I had a nasty leg break. I have a 3 year old toddler who is great and I don't feel I am a good enough parent to. Any book recommendations that might help me navigate some of this? Thanks!  P.s. I am getting appropriate professional help for all of this, but it would be great to have some books that can help me process things when I'm alone.", "comments": ["I’m so sorry you’re having such a bad time. When I lost my niece and mother within months of each other, I read The Midnight Library by Matt Haig, My Year of Magical Thinking by Joan Didion, Stumbling Stones by Airdre Grant, and, the ones that probably helped the most, The Space Between the Stars by Indira Naidoo and Wintering and Enchantment (2 books, not one title) by Katherine May. I hope you can lose yourself in a comforting book. It really does help.", "I really liked The Year of Magical Thinking by Joan Didion after my dad passed. ", "Under the Whispering Door by TJ Klune. \nIt’s beautiful and sad and lovely.", "First, I’m really sorry you’re going through this. It’s so much all at once, and it’s brave of you to ask for support. Books can sometimes offer comfort when it feels like the world is too heavy, and I’m glad you’re already seeking help.\n\nA few books that might offer both guidance and comfort:\n\n1. **\"The Year of Magical Thinking\" by Joan Didion**. It’s raw and deeply reflective, capturing the process of grief in a way that’s both personal and universal. It might help you feel seen in your own grief journey.\n2. **\"The Gifts of Imperfection\" by Brené Brown**. This one dives into self-compassion and letting go of the pressure to be perfect, especially as a parent. It's grounded in research but also feels like a conversation with a compassionate friend.\n3. **\"When Breath Becomes Air\" by Paul Kalanithi**. A memoir from a neurosurgeon who faced terminal cancer and reflected on the meaning of life, suffering, and purpose. It’s incredibly poignant and thought-provoking, especially in the face of loss and hardship.\n4. **\"Radical Acceptance\" by Tara Brach**. This book might be a good read to help you process feelings of inadequacy, especially around parenting. It explores the power of self-acceptance and learning to be kinder to yourself during tough times.\n5. **\"The Body Keeps the Score\" by Bessel van der Kolk**. If you're feeling the physical and emotional weight of everything you’ve been through, this book explains how trauma can be stored in the body and offers ways to heal. It’s therapeutic and insightful, though it can be heavy at times.\n\nRemember, there’s no perfect way to navigate grief, stress, or parenting—it’s all messy and unique. But these books might offer some comfort and grounding when you need it most. Do any of these sound like they could be a good fit right now?", "Thanks so much. I actually read the midnight library straight after they passed and it definitely helped in a way. I'll definitely be checking out The Space Between the Stars and the two books by Katherine May.", "Thanks! I'm going to check this one out"], "suggested_books": [", Stumbling Stones", "The Midnight Library", ", My Year of Magical Thinking", "Radical Acceptance", "The Year of Magical Thinking", "The Gifts of Imperfection", "When Breath Becomes Air", "The Body Keeps the Score", "The Space Between the Stars"], "score": 3, "id": "1jmuvlf", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmuvlf/books_that_help_navigate_challenging_times_in_life/"}
{"title": "Books about details of Holocaust or Untermensch", "body": "Hello I apologize for the dark subject but I am trying to learn about the truth and details about the Nazi Holocaust. Today in Austin Texas there was a Nazi eguenics conference at the university of Texas campus, this got me curious.   Specifically about the industrialists and the wealthy who sponsored the companies involved in the death camps. The process of the death camps. Stories of the people involved. I am also curious about the development of Untermensch and the Nazis killing disabled people.   Bonus points for people who can find books about linking the American antellebum South with inspiring Hitler.   I have already read Annie jacobson's operation paperclip, poisoner in chief by Talbot, and I'm now reading the devil's chessboard the link between the CIA and the Nazis. As well as blitzed and the other books by that author.    Thank you I appreciate it.", "comments": ["The Theory and Practice of Hell: The German Concentration Camps and the System Behind Them", "\"The nearest any of this came to prefiguring Nazi ideology was in the writings of Alfred Ploetz, who spiced his theories with a strong dose of antisemitism and collaborated with Nordic supremacist groups… Ploetz took a ruthlessly meritocratic line on eugenic planning, arguing, for example, that a panel of doctors should attend all births and determine whether the baby was fit to survive or should be killed as weak and inadequate. The Darwinist Alexander Tille openly advocated the killing of the mentally and physically unfit, and agreed with Ploetz and Schallmayer that children’s illnesses should be left untreated so that the weak could be eliminated from the chain of heredity. In 1905 Ploetz and his sometime brother-in-law, the like-minded Ernst Rüdin, founded the Racial Hygiene Society to propagate their views. It rapidly gained influence in the medical and welfare professions...\n\n“By the eve of the First World War, their ideas had spread in one form or another to areas such as medicine, social work, criminology and the law. Social deviants such as prostitutes, alcoholics, petty thieves, vagrants and the like were increasingly regarded as hereditarily tainted, and calls amongst experts for such people to be forcibly sterilized had become too loud to escape attention. Such was the influence of these ideas on the welfare establishment that even the Social Democrats could take seriously the proposal of Alfred Grotjahn to link housing and welfare improvements with the compulsory sterilization of the insane, the ‘workshy’ and the alcoholic.\n\n“Developments such as these reflected the growing influence of the medical profession over rapidly growing specialisms such as criminology and social work. The triumphs of German medical science in discovering the bacilli that caused diseases such as cholera and tuberculosis in the nineteenth century had given it unparalleled intellectual prestige as well as inadvertently furnishing antisemites with a whole new language in which to express their hatred and fear of the Jews. As a result, it had brought about a widespread medicalization of society, in which ordinary people, including an increasing proportion of the working class, had begun to adopt hygienic practices such as washing regularly, disinfecting bathrooms, boiling drinking water and so on. The concept of hygiene began to spread from medicine to other areas of life, including not only ‘social hygiene’ but also, crucially, ‘racial hygiene’.\n\n“To be sure ... the effect that such ideas had on government policies and their implementation before 1914 was not very great, \\[but there were propagandists for the breeding of a blond, Aryan super-race\\] ...\n\n“\\[T\\]he emergence of these ideas, together with the increasing role they played in public debate, was a significant element in the origins of Nazi ideology. Several fundamental principles united virtually everyone in this motley crowd of scientists, doctors and propagandists for racial hygiene. The first was that heredity played a significant role in determining human character and behaviour. The second, which followed on from this, was that society, led by the state, should manage the population in order to increase national efficiency. The ‘fit’ had to be persuaded, or forced, to breed more, the ‘unfit’ to breed less. Thirdly, however these terms were understood, the racial hygiene movement introduced an ominously rational and scientific categorization of people into those who were ‘valuable’ to the nation and those who were not. ‘Low quality’ - the German term was *minderwertig*, literally, ‘worth-less’—became a stock term used by social workers and medical men for many kinds of social deviant before the First World War. By labelling people in this way, the race hygienists opened the way towards the control, the abuse and finally the extermination of the ‘valueless’ by the state, through measures such as forcible sterilization and even execution, which some of them at least were already advocating before 1914. Finally, such a technocratically rationalistic approach to population management presupposed an entirely secular, instrumental approach to morality. Christian precepts such as the sanctity of marriage and parenthood, or the equal value of every being endowed with an immortal soul, were thrown out of the window. Whatever else such ideas were, they were not traditional or backward-looking. Indeed, some of their proponents, such as Ludwig Woltmann and Wilhelm Schallmayer, thought of themselves as being on the left rather than the right of the political spectrum… Fundamentally, racial hygiene was born of a new drive for society to be governed by scientific principles irrespective of all other considerations. It represented a new variant of German nationalism, one which was never likely to be shared by conservatives or reactionaries, or endorsed by the Christian Churches or indeed by any form of organized or established religion. \n\n“Both antisemitism and racial hygiene were to be key components of Nazi ideology. They were both part of a general secularization of thought in the late nineteenth century” (pp. 36-8, ***The Coming of the Third Reich*** **by Richard J. Evans**).", "Who is downvoting your comment? That's ridiculous", "“Both antisemitism and racial hygiene were to be key components of Nazi ideology…. Nietzsche was a vigorous opponent of antisemitism, he was deeply critical of the vulgar worship of power and success which had resulted (in his view) from the unification of Germany by military force in 1871, and his most famous concepts, such as the ‘will to power’ and the ‘superman’ were intended by him to apply only to the sphere of thought and ideas, not to politics or action. But the power of his prose allowed such phrases to be reduced all too easily to slogans, ripped from their philosophical context and applied in ways of which he would have greatly disapproved. His concept of an ideal human being, freed from moral constraints and triumphing through will-power over the weak, could be appropriated without too much difficulty by those who believed, as he did not, in the breeding of the human race according to racial and eugenic criteria. Central to such interpretations was the influence of his sister Elisabeth Forster, who vulgarized and popularized his ideas, emphasizing their brutal, elitist aspects …. Writers such as Ernst Bertram, Alfred Baumler and Hans Gunther reduced Nietzsche to a prophet of power. and his concept of the superman to a plea for the coming of a great German leader unfettered by moral constraints or Christian theology.\n\n“Others, drawing on German anthropological studies of indigenous societies in New Guinea and other parts of the German colonial empire, took Nietzsche’s spiritual elitism a step further and called for the creation of a new society ruled by a band of brothers, an elite of vigorous young men who would rule the state rather like a medieval knightly brotherhood In this deeply misogynistic view of the world, women would have no role to play except to breed the elite of the future, a belief shared in less radical ways by many of the eugenicists and racial hygienists. Academic writers like Heinrich Schurtz propagated the ideology of the band of brothers through a variety of publications, but it had its greatest effect in areas such as the youth movement, in which young, mostly middleclass men devoted themselves to hiking, communing with nature, singing nationalist songs around camp fires and pouring scorn on the staid politics, hypocritical morality and social artificiality of the adult world. Writers such as Hans Blither, strongly influenced by the youth movement, went to even greater extremes in their plea for the state to be reorganized along anti-democratic lines and led by a close-knit group of heroic men … Advocates of such ideas already began to found pseudo-monastic, conspiratorial organizations before the First World War, notably the Germanic Order, established in 1912. In the world of such tiny secular sects, ‘Aryan’ symbolism and ritual played a central role, as their members reclaimed runes and sunworship as essential signs of Germanness, and adopted the Indian symbol of the swastika as an ‘Aryan’ device, under the influence of the Munich poet Alfred Schuler and the race theorist Lanz von Liebenfels, who flew a swastika flag from his castle in Austria in 1907. Strange though ideas like these were, their influence on many young middle-class men who passed through the youth movement organizations before the First World War should not be underestimated. If nothing else, they contributed to a widespread revolt against bourgeois convention in the generation born in the 1890s and 1900s (pp. 39-40, ***The Coming of the Third Reich*** **by Richard J. Evans).**", "“\\[T\\]he Nazi regime systematically murdered only three groups of human beings: the handicapped, Jews, and Gypsies” (p. xiii).\n\nEugenics was believed to be a state-of-the-art science in 1930s Germany(p. 7).\n\n“During the period of the Empire and the Weimar Republic, support for eugenics came from all political parties – conservative, liberal and even socialist” (p. 10).\n\nAlfred Grotjahn was a Social Democrat and leading eugenicist Karl Keutsky the leading theoretician of German Social Democracy were against leaving abortion decisions to individual women as “un-socialist.” Those on the left favored “Lamarckian approach to eugenics while those on the right, as well as some on the left, adhered strictly to a Mendelian approach.”  Lamarck = genetics + environment; Mendel = genetics not influenced by environment (p. 10).\n\n“German ‘race hygiene’ succeeded in imposing on society its radical vision of a biological-social utopia” (p. 16).\n\n Voluntary sterilization programs began under the Weimar government.  Nazis made sterilization mandatory for the disabled (p. 18).\n\n***The Origins of Nazi Genocide: From Euthanasia to the Final Solution*** **by Henry Friedlander.**\n\n\\+\n\nHitler was much more influenced by the works of Karl Marx and Charles Darwin than he was antebellum American Southerners. Further, a great number of American eugenicists, such as New Yorker Margaret Sanger and Charles Davenport from Connecticut, were Northerners: not Southerners."], "suggested_books": ["The Coming of the Third Reich"], "score": 0, "id": "1jn27x7", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn27x7/books_about_details_of_holocaust_or_untermensch/"}
{"title": "Looking for stories where \"A Giant helps a little person/being", "body": "I found out about 2 VR games with this concept and I really like it.  One it's \"Moss\" where you help a little mouse as a Giant invisible being.   And the second one it's \"Ghost Giant\" where you help a young cat on a suburban adventure.  I want to ask if you know about books or even fanfics with the same Concept. I really like it and I see a lot of potential.  Thanks in advance.", "comments": ["The BFG by Roald Dahl", "**The BFG** by Roald Dahl is the obvious one.\n\n**The Borrowers** series is sort-of that concept as the Giants are normal humans and the main characters are tiny people.\n\n**The Hounds Of the Morrigan** has a couple of scenes where a Giantess helps the main characters, but it's not the primary plot of the book.\n\nThe **Star Kingdom** series (Book 1 - A Beautiful Friendship) by David Weber and Jane Lindskold has Giants (humans) helping Little People (Treecats) but the 'cats are slightly larger than terrestrial housecats, so this may not truly count.\n\nThe **Harry Potter** series has Rubeus Hagrid, a half-giant who helps the titular character.", "Thank you. I have heard about the Borrowers but not the rest, I have to check them out."], "suggested_books": ["The BFG"], "score": 3, "id": "1jmutgk", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmutgk/looking_for_stories_where_a_giant_helps_a_little/"}
{"title": "Suggest me a book that feels like the Netflix's show Dark.", "body": "Ever since I've watched that show, I am looking for anything that scratches that itch. And I don't mind science heavy books (most of the times, I can understand them). So suggest me something. If its a book series then its even better, the longer the better (no pun intended!)", "comments": ["Recursion by Blake Crouch was pretty solid\n\nNothing really holds a candle to Dark IMO, but it's still a great read that leaves you guessing throughout the whole book.", "What itch are you trying to scratch exactly ? Is it the time-travel plot? The expansive cast of characters? The overall bleak vibes? The tragic fates and relationships? The small-town setting? This might help get a more specific recommendation.", "Annihilation by Jeff Vandermeer (but probably not the sequels).\n\nPart of Florida gets sucked into a parallel/weird world. Teams are sent in to study it and every mission ends poorly. You start reading as the eleventh expedition goes in, from the perspective of a biologist whose husband went on mission 10.", "The City & The City by China Mievielle, perhaps. \n\n\nAwesome concept and world building. The individual pieces are quite different from Dark, but the overall impression it gave me was quite similar.", "DARK is my fav show ever and i dont know how to explain it but I Who Have Never Known Men. Not much in common but made me feel the same.", "The Gone World by Tom Sweterlich", "The First Fifteen Lives of Harry August", " Cloud cuckoo land", "Cloud Atlas.", "The man who folded himself"], "suggested_books": ["Recursion", "Annihilation", "The Gone World"], "score": 30, "id": "1jmh1k4", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmh1k4/suggest_me_a_book_that_feels_like_the_netflixs/"}
{"title": "Suggest me your favorite self help book that isn’t technically a self help book.", "body": "Molly Shannon’s recent memoir comes to mind for me. So inspiring with a very bleak yet fun vibe that resonates with me.", "comments": ["Meditations by Marcus Aurelius", "What My Bones Know by Stephanie Foo.  A memoir about C-PTSD that got me thinking about my own trauma.", "A Psalm For The Wild Built. \n\nThe Little House in the Prairie series.", "Furiously Happy by Jenny Lawson.", "Misery by Stephen King is a really good book about the writing process.", "Glennon Doyle’s memoirs", "The Magic Apple Tree by Susan Hill", "The Let Them Theory", "*Not by Accident* Samantha Dunn", "The David Goggins books for sure."], "suggested_books": ["Meditations", "What My Bones Know", "Furiously Happy", "Misery", "The Magic Apple Tree", "Not by Accident"], "score": 9, "id": "1jmmk0v", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmmk0v/suggest_me_your_favorite_self_help_book_that_isnt/"}
{"title": "Recommend me a book :]", "body": "I love a good romance story. I've read The Folk of the Air series, The Empyrean Series,  The Red Queen series. Lots of fantasy and romance. I do like a good classic like Anthem by Ayn Rand. I also want to read a good emotional story. Any requests?", "comments": ["- One Dark Window & Two Twisted Crowns by Rachel Gillig (Gothic fantasy romance. A bit dark at times, but the prose is beautiful, and there are two wonderful love stories woven in).\n\n\n- House of Salt and Sorrows & House of Roots and Ruin by Erin A. Craig (again, Gothic fantasy romance - with a dash of horror, but not too intense. Both books are beautiful, atmospheric, and have love stories as notable parts of the plot).\n\n\n\n\n- Dream by the Shadows by Logan Karlie (first installment in a duology; book 2 is on the way. It's definitely inspired by Labyrinth, similar vibes, and the male main character is like a combination of Jareth and Rhysand).", "The Hurricane Wars by Thea Guanzon\n\nSmall Miracles by Olivia Atwater\n\nFrom Blood and Ash by Jennifer L. Armentrout\n\nThe Teller of Small Fortunes by Julie Leong\n\nQuicksilver by Callie Hart\n\nThese Hollow Vows by Lexi Ryan\n\nSpinning Silver by Naomi Novik\n\nThe Midnight Bargain by CL Polk\n\nEmily Wilde’s Encyclopaedia of Faeries by Heather Fawcett\n\nThe Night Market by Jesikah Sundin\n\nSwordcrossed by Freya Marske\n\nThe Obsidian Tower by Melissa Caruso\n\nWedded to the Wanton Witch by SL Prater\n\nThe Serpent and the Wings of Night by Carissa Broadbent\n\nMortal Follies by Alexis Hall\n\nThe Emperor and the Endless Palace by Justinian Huang\n\nAmid Clouds and Bones by Ella Fields", "Kink by Kathe Koja had me me raising my arm and cheering at the end. It's intense, not so much because of the subject matter, but the way she writes made me experience what was happening to the MC. Also it's not about kinky sex. : )  \nThe Girl in a Swing by Richard Adams(of Watership Down fame) is phenomenal. Beautiful, buccolic, a bit of American southern gothic even though it takes place mostly in...Denmark? and  a rural area of England. It also has horror elements, but it's not specifically a horror novel.  \nMaking Love by Melanie Tem and Nancy Holder is also very good. It has some supernatural elements the authors use to talk about the who the MC is more than just as an aspect of the book.", "What is this \"Labyrinth\"? I keep seeing the names Jareth and Rhysand on Pinterest and stuff", "Labyrinth is a fantasy movie from the '80s about a girl whose baby brother gets kidnapped by Jareth, the Goblin King, and she has to navigate the King's labyrinth to rescue him. \n\n\nThe MMC of Dream by the Shadows is similar to Jareth in that he's an age old being in charge of a realm of monsters. His powers and overall vibe are also kind of similar to Rhysand from Sarah J. Maas's ACOTAR series."], "suggested_books": ["- Dream by the Shadows", "Quicksilver", "Swordcrossed", "These Hollow Vows", "Spinning Silver", "Emily Wilde’s Encyclopaedia of Faeries", "From Blood and Ash", "Mortal Follies", "The Serpent and the Wings of Night", "The Night Market", "Small Miracles", "The Emperor and the Endless Palace", "The Girl in a Swing", "Kink", "Labyrinth"], "score": 1, "id": "1jn1nt6", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jn1nt6/recommend_me_a_book/"}
{"title": "Suggest me a book you loved where the cover made you read it in the first place.", "body": "I want to judge a book by its cover! Suggest your favorite books with your favorite covers! I don't have a preference on genre or topic.", "comments": ["A Psalm For The Wild Built by Becky Chambers! I really loved the cover, flowers everywhere, a cute robot and a wagon? And then the book was wonderful, like a warm hug. :)\n\nThe Starling House by Alix E. Harrow! The cover is gorgeous, the colors, the starlings, the yellow flowers.. So good. And Alix E. Harrow is a fantastic writer.\n\nAmerican Rapture by C.J. Leede! Now, this one isn't for the faint of heart. The book is pretty brutal, but I LOVED it. It does have a pretty horrific animal death in it though, so TW with that. The cover had initially drawn me to it, though, It's so colorful and neon and I personally think religion iconography is neat, even if I'm not religious myself, lol.", "Valley of the Dolls by Jacqueline Susann\n\nI was 9yo and liked the pink cover at The Strand. My parents indeed let me read it.", "You know those blurbs on the backs of book covers? Best one I've seen is on the 1995 book \"The Hot Zone: The Terrifying True Story of the Origins of the Ebola Virus\" by Richard Preston. It says:\n\n\"One of the most horrifying things I've ever read. What a remarkable piece of work.\"  \n\\--Stephen King", "Starter Villain by John Scalzi- the cover is a cat in a suit 😭 so I was like yeah I gotta know what that’s about lol", "My Best Friend’s Exorcism by Grady Hendrix.  The paperback is done up like a 1980s horror VHS box.", "Oh what a fun question. Some books I’ve loved that I originally picked up because I thought they had a particularly interesting or beautiful cover:\n\nSame Bed Different Dreams by Ed Park\n\nSweet, Soft, Plenty Rhythm by Laura Warrell\n\nBody Work by Melissa Febos\n\nLand of Big Numbers by Te Ping Chen\n\nMalaya: Essays on Freedom by Cinelle Barnes\n\nLuster by Raven Leilani (one that’s better in person because of the way it’s shiny)\n\nFrom a Low and Quiet Sea by Donal Ryan\n\nNative by Syed Kashua\n\nWelcome to Lagos by Chibundu Onuzo\n\nFreshwater by Akwaeke Emezi\n\nHonorable mention to some that didn’t end up becoming personal favorites of mine, but were still plenty good and had covers I really liked:\n\nPonti by Sharlene Teo\n\nYume by Sifton Tracey Anipare\n\nLucky Red by Claudia Cravens\n\nScorched Grace by Margot Douaihy\n\nFrankenstein In Baghdad by Ahmed Sadawi\n\nMona by Pola Oloixarac", "Where the Crawdads Sing by Delia Owens and The Way Out by B. Fox. They are among my favorite covers.", "The Italian cover of Genesis by Beckett might be my all time favorite cover and perfect for the book. I actually got the book in English and glued it on. Beautiful book as well", "Dark Matter - Blake Crouch\n\nAnd for anyone who knows Swedish, since I don’t think it has a translation.\nKrigarhjärta - Henrik Larsson", "The Master and Margarita by Mikhail Bulgakov, specifically the Pevear and Volokhonsky translation"], "suggested_books": ["A Psalm For The Wild Built", "Valley of the Dolls", "Starter Villain", "My Best Friend’s Exorcism", "Scorched Grace", "Frankenstein In Baghdad", "Sweet, Soft, Plenty Rhythm", "Freshwater", "Lucky Red", "Yume", "Welcome to Lagos", "Same Bed Different Dreams", "Ponti", "Body Work", "Land of Big Numbers", "From a Low and Quiet Sea", "Luster", "Where the Crawdads Sing", "The Master and Margarita"], "score": 5, "id": "1jmq8fm", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmq8fm/suggest_me_a_book_you_loved_where_the_cover_made/"}
{"title": "Favorite Poetry recommendations", "body": "I’m new to poetry so am not sure what I like yet?", "comments": ["Excited for you to dive into poetry! It's such a vast and beautiful world.", "A Thousand Mornings by Mary Oliver\n\nSpace Struck by Paige Lewis \n\nHow to Communicate by John Lee Clark", "Best of Robert Service. Then you'll want it all.", "Love this question because poetry can be wildly different depending on where you land, and the fact that you're starting with an open mind is the best possible place to begin.\n\nHere’s a sampler platter of styles to help you explore:\n\n**If you want raw emotion and relatability:**\n\n* *Milk and Honey* by Rupi Kaur gets a lot of flak from purists, but it's a gentle entry point, especially if you’ve never read poetry before.\n* *The Sun and Her Flowers* also by Kaur, builds on similar themes with a little more maturity.\n\n**If you’re drawn to language that** ***feels*** **like music:**\n\n* *Ocean Vuong’s* *Night Sky with Exit Wounds* is absolutely stunning. His poems are rich, emotional, and layered with meaning you can return to again and again.\n* *Ada Limón’s* *The Carrying* is another powerful collection that blends everyday life with lyrical insight. Honest, beautiful, grounded.\n\n**If you want something dark, weird, or philosophical:**\n\n* *Richard Siken’s* *Crush* is intense, romantic, and haunted. If you’ve ever felt something so deeply it scared you, this will resonate.\n* *Mary Oliver’s* *Devotions* is the gentler mirror—nature, time, and spiritual grounding. It’s like breathing clean air.\n\n**If you like storytelling in verse:**\n\n* *Brown Girl Dreaming* by Jacqueline Woodson is a memoir told in poems—beautiful, accessible, and powerful.\n* *The Poet X* by Elizabeth Acevedo is YA, but emotionally sharp and incredibly engaging.\n\nTry flipping through a few collections without the pressure to “get” them all. Poetry often rewards *vibes first, meaning later*. You’ll start to notice what styles or voices make you pause and reread.\n\nDo you tend to connect more with romantic themes, nature, grief, growth, or something else? I can narrow in a bit more if you’ve got a vibe you’re chasing.", "I second Mary Oliver"], "suggested_books": ["A Thousand Mornings", "Space Struck", "How to Communicate", "* *The Poet X*"], "score": 3, "id": "1jmtogg", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmtogg/favorite_poetry_recommendations/"}
{"title": "Where to start with Japanese literature?", "body": "I (37m) from the US and have recently been seeing Japanese literature popping up for me on Facebook, which has made me intrigued. I practice Zen Buddhism (for years) and gravitate towards concepts such as impermanence, interconnection, oneness with nature/animals, stillness, gratitude, bittersweet, Wabi Sabi, etc.   Could you suggest some books you think may be up my alley?   I’m open to all types of books from slice of life human dramas to more fantastical/magical genres. I’d appreciate more mature characters given my age versus young adult.   Thanks in advance!", "comments": ["Start with any novels by Haruki Murakami. \n\nIf you like Murakami then try The Full Moon Coffee Shop by Mai Mochizuki.", "Anything by Yasunari Kawabata. *Kokoro* or *The Gate* by Natsume Sōseki. Something by Jun'ichirō Tanizaki, especially *The Makioka Sisters* or *In Praise of Shadows*. For contemporary books, *Tokyo Ueno Station* by Yu Miri or something by Yoko Tawada like *Memoirs of A Polar Bear.*", "The Memory Police by Yoko Ogawa!", "Before The Coffee Gets Cold series and Traveling Cat Chronicles. Be prepared to sob over the second if you an animal lover.", "My favorite has been What You Are Looking for is in the Library by Michiko Aoyama.", "The Pillow Book", "*The Easy Life in Kamusari*", "Horror is probably my favorite genre. I'd recommend Audition by  Ryu Murakami.\n\n**Most** of the book isn't horror at all, really. It's about a widower in his forties who, upon the prodding of his son and best friend, decides maybe it's time to get into dating again. So, he sets up an audition under the guise of a fake TV show. Things don't go exactly according to plan.", "Keigo Higashino - His main genre is actually detective but he wrote some books about human dramas, or put human dramas into a detective book; then sometimes his books have fantasy/magical factors.\n\nWould recommend you check out *The Devotion of Suspect X* and *The Miracles of the Namiya General Store*", "I'm recommending a nonfiction book, **Underground: The Tokyo Gas Attack and the Japanese Psyche**, by Haruki Murakami. For me it was an interesting reminder that religious extremism in any guise, even the Eastern philosophies, can be dangerous. The interviews with Aum adherents were especially enlightening. I don't think any of these people consciously intended to do evil when they set out on their spiritual paths. But they did."], "suggested_books": ["Tokyo Ueno Station", "Kokoro", "In Praise of Shadows", "The Makioka Sisters", "Memoirs of A Polar Bear.", "The Memory Police", "The Coffee Gets Cold", "The Devotion of Suspect X*", "The Miracles of the Namiya General Store", "The Devotion of Suspect X"], "score": 6, "id": "1jmolcr", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmolcr/where_to_start_with_japanese_literature/"}
{"title": "Books (preferably queer) about loneliness and trauma?", "body": "I really liked  the autobiography My Lesbian Experience with Loneliness by Nagata Kabi.   She captured that feeling of feeling broken your whole life, having extreme social anxiety, and spending forever to just to feel adequate enough to get to the beginning line that everyone else seems to start at…   Are there any other books that deal with that kind of topic? I would prefer nonfiction but fiction is also okay.", "comments": ["A queer book that deals with trauma and loneliness is that I thought was really beautiful is Oranges are not the only fruit by Jeanette Winterson, though it doesn't necessarily have the late bloomer element.\nI loved reading the combination of Oranges are not the only fruit and Why be happy when you could be normal by her. The first (which is the one I would pick if you only read one) is autobiographical magical realism that she wrote when she was younger about her experiences growing up. Being a lesbian, loneliness, and other psychological elements such as abuse at the hands of her adoptive family and community are themes, and it's beautifully written. Why be happy when you could be normal is her actual autobiography she wrote at an older age and I also found it beautiful and very interesting from the psychological standpoint, the two books complement each other\n\nI would also recommend the short story The terracotta bride by Zen Cho. It's also about a gay girl, and it's one of my all time favorite short stories. It deals with loneliness and trauma and not having had the time or the chance to understand who you could be and what you could do. It's set in the chinese taoist/buddhist afterlife", "How about *The Well of Loneliness* by Radclyffe Hall?", "*Fun Home* by Alison Bechdel (graphic novel memoir), hands down. I also suggest *Glass Cathedral* by Andrew Koh, *Pulse* by Lydia Kwa, and, of course, Ocean Vuong's *On Earth We're Briefly Gorgeous*.", "Daddy Issues by Dino Pešut – >!Queer Croatian autofiction about a gay man returning home to his dying father. Brutally honest, full of emotional stagnation, family baggage, and the push-pull between care and resentment.!<\n\nI’m Glad My Mom Died by Jennette McCurdy – >!Not queer-centered, but hits HARD on parental trauma, eating disorders, and the exhausting pressure to perform being okay. Raw and weirdly funny too.!<\n\nThe Discomfort of Evening by Marieke Lucas Rijneveld – >!Dutch novel, extremely bleak. About grief, isolation, and repressed desires in a hyper-religious rural family. Queer themes, very bodily and intense. Fiction, but feels like memoir.!<\n\nA Man Called Ove by Fredrik Backman – >!Straight old man protagonist, but the core is about loneliness, grief, and re-learning how to exist among others. Quiet and beautiful. More heartwarming in tone, but still honest about despair.!<\n\nDetransition, Baby by Torrey Peters – >!Trans, queer, messy. Navigates trauma, identity, relationships, and trying to create something like a family from the ashes. Characters all feel like they're dragging themselves through life with baggage in tow.!<\n\nFun Home by Alison Bechdel – >!Memoir grappling with a distant, closeted father, queer identity, and emotional repression. Iconic for a reason. Gothic and precise.!<\n\nLong Live the Post Horn! by Vigdis Hjorth – >!A woman in a fog of apathy and social paralysis gets drawn into... mail reform? But seriously, it's about dissociation, late-bloomer energy, and that weird moment when you start to care again. Not queer, but thematically similar.!<", "*Punch Me Up to the Gods* by Brian Broome is a really excellent memoir about growing up in rural Ohio as a queer, Black boy. Highly recommend.", "The Starless Sea by Erin Morgenstern. It's fantasy fiction and has a dreamlike prose, but the themes fit", "*Mean Little deaf Queer* by Terry Galloway (memoir)", "Solo Dance by Li Kotomi and Notes of a Crocodile by Qiu Miaojin are both auto-fiction to some degree and definitely show the loneliness that can come with being queer", "Thank you! Both of them sounds lovely", "You're welcome! Hope you enjoy them :)"], "suggested_books": ["The Well of Loneliness", "Glass Cathedral", "On Earth We're Briefly Gorgeous", "Pulse", "*Fun Home*", "Fun Home", "Detransition, Baby", "The Discomfort of Evening", "Daddy Issues", "Long Live the Post Horn!", "A Man Called Ove", "I’m Glad My Mom Died", "Fun Home", "Punch Me Up to the Gods", "The Starless Sea", "*Mean Little deaf Queer*", "Mean Little deaf Queer", "Solo Dance"], "score": 3, "id": "1jmqqg7", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmqqg7/books_preferably_queer_about_loneliness_and_trauma/"}
{"title": "Suggest me a book about the history and science of ayahuascua", "body": "I truly enjoyed michael Pollan's how to change your mind. Recently I've become more curious specifically about ayahuascua and I would like to learn more of the history and science behind it.  However I'm not looking for a load of new age mumbo jumbo, stuff that's rooted in the details we know.  Thanks!", "comments": ["Ayahuasca: Rituals, Potions and Visionary Art from the Amazon", "Michael Pollan's work is a fantastic starting point!\n\n*The Fellowship of the River* by Joe Tafur is another good read that fits this style", "Trippy: The Peril And Promise of Medicinal Psychedelics by Ernesto Londono", "I actually looked into this one before! Does he ever get over his asshole skepticism? Like I'm a big skeptic and very science based, not into super new age beliefs, but this guy just seemed to mock a lot of the ceremonies early on and just came across as super arrogant which put me off going further.\n\nWorth reading on?", "I thought it was. Your mileage may vary."], "suggested_books": ["The Fellowship of the River", "*The Fellowship of the River*"], "score": 5, "id": "1jmp19z", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmp19z/suggest_me_a_book_about_the_history_and_science/"}
{"title": "Suggest me a good book related to history of food", "body": "I am interested in knowing how the food has evolved; the cultural and anthropological aspects of it. I tried to find a book like it on Amazon, but I couldn’t. Please suggest me something like this", "comments": ["If you're into the history of food and how it's shaped civilizations, *\"Salt: A World History\"* by Mark Kurlansky is a fantastic starting point. It’s one of those books that takes something simple and turns it into this sprawling, fascinating story about trade, war, culture, and survival. Salt literally shaped economies and built empires, and Kurlansky does a great job weaving together historical facts with storytelling, so it never feels like a dry read (pun intended). It's also full of little culinary nuggets that make you appreciate how something we totally take for granted today was once a major driver of global change.\n\nAnother excellent pick is *\"An Edible History of Humanity\"* by Tom Standage. It’s a bit more broad, looking at how different foods and agricultural advances changed the course of human development—from early farming to the spice trade to modern industrial food. Standage has a really approachable writing style, and it’s a great mix of history, science, and cultural analysis. If you're looking for books that don’t just talk about what we eat but why we eat it—and how those choices shaped the world—these two will definitely hit the spot.", "The Omnivore's Dilemma: A Natural History of Four Meals by Michael Pollan is a classic.", "The Cooking Gene by Michael W. Twitty, about the African origins of Southern American cuisine.", "Catching Fire: How Cooking Made Us Human by Richard Wrangham", "I really enjoyed Food of a Younger Land by Mark Kurlansky. It’s about regional American cooking, pulled from WPA files. It’s really interesting!", "[Gastro Obscura: A Food Adventurer’s Guide](https://www.goodreads.com/book/show/49151024-gastro-obscura)", "*Taste: The Story of Britain Through Its Cooking* by Kate Colquhoun is for general audiences and quite entertaining. Otherwise, *Dubious Gastronomy* by Robert Ji-Song Ku and *Flavors of Empire* by Mark Padoongpatt!", "Much depends on Dinner by Margaret Visser", "Frozen Water Trade by Gavin Weightman\n\nIt is about the man who made a business out of harvesting ice from New England ponds. He gave a lot of trials and failures, but eventually trade routes were set up to India, parts of the Caribbean and the American south. It was really cool to see how the technology evolved and learn how's long and far they could take ice without it melting.", "Pumpkin by Cindy Ott. \n\n(It’s focuses on pumpkin specifically but I found it interesting nonetheless.)"], "suggested_books": ["An Edible History of Humanity", "\"An Edible History of Humanity\"", "The Omnivore's Dilemma: A Natural History of Four Meals", "The Cooking Gene", "Catching Fire: How Cooking Made Us Human", "Flavors of Empire", "Dubious Gastronomy", "Much depends on Dinner", "Frozen Water Trade"], "score": 11, "id": "1jmjmmn", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmjmmn/suggest_me_a_good_book_related_to_history_of_food/"}
{"title": "Just got a Kindle, what would you recommend for fantasy books on Kindle Unlimited", "body": "As the title reads, I just got a kindle and am looking for fantasy series that are on Kindle Unlimited or even just one book in the whole series.", "comments": ["I just finished Quicksilver by Callie Hart and that's on KU. It's a romantasy, so just be aware there is spice. It was pretty good, took me a little to get into but I was invested by the end. 1st book in the series, next one doesn't come out until the end of the year.", "Congrats on the Kindle! Kindle Unlimited has some great fantasy options. You might enjoy The Shadow of What Was Lost by James Islington or The Legends of the First Empire series by Michael J. Sullivan. Both have gripping stories and immersive worlds. Happy reading!", "I don't typically read on kindle, but The Valkyrie Bestiary series seems promising (I've only read the first so far) if you are into Urban Fantasy. The first book is Dragons Don't Eat Meat by Kim McDougall", "Cradle", "Find Jeff Wheeler. He has a bunch", "One of my favorites is Calamity by Rachel N Chuirc, the author was one of the writers for the Baldur's Gate 3 video game if you happen to be familiar.  The Fellowship of the Ring by JRR Tolkien is also on KU", "I read Vengeance and Honour by Ben Dixon on KU and loved it. It was sword and sorcery with a great adventure quest but also a lot of fun.", "Angel Chronicles: The Prince of Persia by Vincent Kane"], "suggested_books": ["The Shadow of What Was Lost"], "score": 4, "id": "1jmqei8", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmqei8/just_got_a_kindle_what_would_you_recommend_for/"}
{"title": "Suggest me a book after reading long fantasy books", "body": "I’m looking for a palette cleanser to read in between fantasy series, I love them but they are long and I think I need a little break. Looking for a 250-300 page, enjoyable read that I don’t want to put down. I like fiction and outside of fantasy enjoy something romantic or mysterious.   Thanks!", "comments": ["John Green “the Anthropocene Reviewed. “\nSA Crosby “BlackTop Wasteland”\nAndy Weir “Project Hail Mary”\nBlake Crouch “ Dark Matter”", "The Jack Reacher books by Lee Child", "*D'Shai* by Joel Rosenberg.  Fantasy loosely based on medieval Japan, but with magic.  MC is a member of an acrobatic troupe, who gets caught up in a murder mystery.  ", "The Last Unicorn by Peter S. Beagle is phenomenal.  \nA Lush and Seething Hell by John Hornor Jacobs is excellent. Two novellas. The 2nd one is a mystery. Is it a real account of what the MC goes through or not sort of thing. \nI just recommended some romance books to another post in this subreddit, two are too long for what you're looking for, but Kink by Kathe Koja is excellent and is 278 pages.", "For some reason your request brings the writer Connie Willis to mind.   \nShe has a lot of lighter work, tending towards comedy of errors while exploring her chosen themes.", "Cinnamon and Gunpowder", "Novellas are a great idea. My favorites include:\nThe Tensorate series: two twins and their groups try to take down their tyrant mother who is a prophet. Deals with self acceptance, grief, free will, ECT. \nThe forever desert series: a series of novellas set in a desert that deals with false history, propaganda, ECT. \nThe singing hills cycle: a series of novellas about a cleric finding stories around the world. Each novel has a different story and can be read indipendently based on taste.", "Seconding Project Hail Mary which was a fun, fast read. No traditional mystery, but rather a lot of problem-solving, since the protagonist starts the book with serious gaps in his memories and is at the same time challenged with solving the puzzle of how to save Earth."], "suggested_books": ["BlackTop Wasteland", "Project Hail Mary", "Dark Matter", "D'Shai", "A Lush and Seething Hell", "The Last Unicorn"], "score": 1, "id": "1jmzy97", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmzy97/suggest_me_a_book_after_reading_long_fantasy_books/"}
{"title": "3 chapters away from finishing A court of silver Flames", "body": "Hey everyone so I’m almost done with the series, I know afterward I’ll be left feeling empty and need something that is similar to this and prefer books with minimal sexual content. Please give me series recommendations that I can check out", "comments": ["Great, go read Lord of the Rings", "- Dream by the Shadows by Logan Karlie\n- The Bone Houses, The Drowned Woods, and The Wild Huntress by Emily Lloyd-Jones (read in order; not officially a series, but all three connect)", "The Obsidian Tower by Melissa Caruso\n\nEmily Wilde’s Encyclopaedia of Faeries by Heather Fawcett\n\nThe Unspoken Name by AK Lakewood\n\nEntranced by Sylvia Mercedes\n\nSincerely Secretary of Doom by Jennifer Kropf\n\nA Deadly Education by Naomi Novik\n\nThe Hurricane Wars by Thea Guanzon\n\nBow Before the Elf Queen by JM Karl\n\nThe Fae King’s Assassin by Alish Klapheke\n\nBride of the Shadow King by Sylvia Mercedes\n\nThrone of Shadows by Tessonja Odette\n\nSpinning Silver by Naomi Novik\n\nThe Bookshop and the Barbarian by Morgan Stang\n\nRunning Close to the Wind by Alexandra Rowland\n\nThe Vampire Debt by Ali Winters\n\nThe Cruel Prince by Holly Black\n\nBy the Orchid and the Owl by Mariah Montoya\n\nThe Moonfire Bride by Sylvia Mercedes\n\nA Fellowship of Librarians and Dragons by J. Penney\n\nQueen of Roses by Briar Boleyn", "If you loved *A Court of Silver Flames* but want something with less spice and still that emotional pull, here are a few series that might hit the same vibe without leaning too hard into the explicit:\n\n**1.** ***The Green Bone Saga*** **by Fonda Lee**  \nDifferent setting, more urban fantasy meets crime family saga, but it has the same emotional complexity, deep character arcs, and found-family dynamics. Way less romance, but the character tension and moral ambiguity are addictive.\n\n**2.** ***The Queen’s Thief*** **series by Megan Whalen Turner**  \nStart with *The Thief*. It's subtle, clever, and the world unfolds gradually across books. There's romance, but it’s understated and more about trust and power than physical attraction. The political intrigue is also top-tier.\n\n**3.** ***The Cursebreaker Trilogy*** **by Brigid Kemmerer**  \nIf you liked the Beauty and the Beast vibes and the Fae politics in ACOSF, this scratches a similar itch. Cleaner in terms of content but still has solid romantic tension and a high-stakes plot.\n\n**4.** ***The Witchlands*** **by Susan Dennard**  \nGreat for people who love magic systems tied to identity, loyal friendships, and slow-burn worldbuilding. There's romance but again, not graphic. The focus leans more toward the adventure and emotional journeys.\n\nAlso, you’re not alone in that post-series slump. It’s a real thing. Sometimes I need a few days of reading nothing just to let the last world go before I can jump into a new one. Curious to hear if you’re more drawn to the romance, the worldbuilding, or the personal transformation arcs in Nesta’s story. That might help tailor recs even better.", "Ohhh okay, I figured you ordered them in a certain order for a reason, would love to check them out. I even heard the title once for The Wild Huntress on social media.", "Omg thank you for the recommendations they all sound really great and I wouldn’t mind getting into all of them eventually. I did love the facts that Nesta had such a character development that it just makes her love her and really understand why she was the way she was. I loved the world building ofc and the map given really helps you paint a better picture", "Also the romance was really cute but I didn’t mind a little splash in there. I love how it wasn’t just a romance book, kinda prefer the adventure more"], "suggested_books": ["- Dream by the Shadows", "The Drowned Woods", "A Deadly Education", "By the Orchid and the Owl", "Bride of the Shadow King", "The Cruel Prince", "Queen of Roses", "The Bookshop and the Barbarian", "Spinning Silver", "Running Close to the Wind", "Emily Wilde’s Encyclopaedia of Faeries", "Throne of Shadows", "Entranced", "The Moonfire Bride", "The Thief", "A Court of Silver Flames", "Beauty and the Beast"], "score": 2, "id": "1jmuiqw", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmuiqw/3_chapters_away_from_finishing_a_court_of_silver/"}
{"title": "Suggest a book that has the warging experience/vibe ASOIAF & Farseer", "body": "From AWOIF wiki: \"person with the ability to enter the mind of an animal and control its actions. A skinchanger able to enter the mind of a wolf or dog is known as a warg.\"  What stories involve or have aspects of animals (mythical or not) & humans connecting mind to mind?", "comments": ["Arrows of the Queen by Mercedes Lackey (can’t remember if they talk outright or if its mind to mind)\n\nHis Majesty’s Dragon by Naomi Novik (can’t remember if they talk outright or if its mind to mind)\n\nThe House Witch by Delemhach\n\nThe Obsidian Tower by Melissa Caruso\n\nFrom Blood & Ash series by Jennifer L. Armentrout (later in the series)\n\nWedded to the Wanton Witch by SL Prater\n\nEmily Wilde’s Encyclopaedia of Faeries by Heather Fawcett", "TY there are a few on here I haven't read. Novik's dragons are old favof mine but they talk out loud not mind to mind."], "suggested_books": ["The House Witch", "Obsidian Tower", "Emily Wilde’s Encyclopaedia of Faeries", "Arrows of the Queen", "His Majesty’s Dragon"], "score": 1, "id": "1jmz010", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmz010/suggest_a_book_that_has_the_warging/"}
{"title": "Books with a comfy rainy day vibe", "body": "I don’t know how else to explain what I’m looking for and it might be hard to make a suggestion for. What comes to mind is like a rainy northwestern forest or something. I’m just looking for something that really gives off a “comfy” vibe. It can be any genre really (except horror, but suspense/thriller is fine) and it doesn’t have to be super outstanding, I’m just looking to read something that kind of matches my mood, not exactly something that’s going to hook me with an insane plot or anything (although it’s fine if it does).", "comments": ["Louise Penny’s Inspector Gamache series, they’re very rooted in different seasons and set in a small village in the woods outside Montreal. Booksellers and artists sitting in a bistro drinking cafe au lait.\n\n\nPossession by AS Byatt too, where two academics retrace a love story between the 19th century romantic poets they specialise in, across the north of England and Brittany.\n\n\nNorth Woods by Daniel Mason is the story of one house over several generations in Massachusetts. \n\n\nAnd, as always, the Secret History!", "Greenwood. \n\nLegends and Lattes. \n\nThe Very Secret Society of Irregular Witches.", "All Creatures Great and Small", "Walden 💚", "Perhaps try The Rainfall Market by You Yeong-Gwang", "Tuesdays with Morrie maybe?", "The Good Girl by Mary Kubica \n\nThe Inmate by Freida Mcfadden \n\nSummit Lake by Charlie Donlea \n\nThe Death of Mrs. Westaway by Ruth Ware \n\nWhen the Stars Go Dark by Paula McLain", "A Novel Love Story by Ashley Poston is set in a fictional small town where it rains every afternoon so that might fit the bill lol", "I just finished Middletide by Sarah Crouch and it is set in the Pacific Northwest and has that vibe.", "The before the coffee gets cold series!! They’re easy comfy books to read and very heartfelt. I find them quite relaxing and a perfect rainy day vibe!! "], "suggested_books": ["North Woods", "the Secret History", "The Death of Mrs.", "Summit Lake", "The Inmate", "the Stars Go Dark", "When the Stars Go Dark", "The Death of Mrs. Westaway", "The Good Girl"], "score": 2, "id": "1jmtxfc", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmtxfc/books_with_a_comfy_rainy_day_vibe/"}
{"title": "Dark Latin American authors like Mariana Enriquez and Roberto Bolaño", "body": "I love the works of Mariana Enriquez. I just picked up a collection by Borges and am currently reading 2666 by Bolaño. I love the characterization steeped in trauma of Enriquez and Bolaño and also, especially with 2666 so far, the slow, creeping dread. So, basically I'm looking for a book that have great prose, traumatized characters, and gothic tones of dread.", "comments": ["Signs Preceding the End of the World by Yuri Herrera – >!Mythic, border-crossing journey with lyrical prose and a creeping sense of doom!<\n\nSenselessness by Horacio Castellanos Moya – >!Paranoid, drunken narrator unravelling while editing genocide testimonies!<\n\nDead Girls by Selva Almada – >!Haunting non-fiction/fiction blend about femicide in Argentina, quiet but brutal!<\n\nPedro Páramo by Juan Rulfo – >!Gothic classic set in a ghost town, drenched in death and memory!<\n\nHurricane Season by Fernanda Melchor – >!Violent, feverish and relentless, with hypnotic prose and a Bolaño-esque cast!<\n\nNever Any End to Paris by Enrique Vila-Matas – >!Wry, melancholic reflection on writing, failure and obsession!<\n\nFever Dream by Samanta Schweblin – >!Nightmarish and fragmented, like falling sick in a world that’s off-kilter!<", "*In the Dream House*", "Jawbone by Monica Ojeda\n\nPink Slime by Fernanda Trias\n\nWormwood by Layla Martinez", "I think you’d like *Elena Knows* by Claudia Piñeiro.", "Eartheater by Dolores Reyes. It’s incredible!", "Fever Dream is so good", "These sounds great!", "Things We Lost in the Fire by Mariana Enriquez should also be added to this list!", "Right!? I loved it."], "suggested_books": ["Dead Girls", "Fever Dream", "Hurricane Season", "Pedro Páramo", "Never Any End to Paris", "Senselessness", "In the Dream House", "Wormwood", "Pink Slime", "Jawbone", "Elena Knows", "Eartheater", "Things We Lost in the Fire"], "score": 7, "id": "1jml6pk", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jml6pk/dark_latin_american_authors_like_mariana_enriquez/"}
{"title": "Historical fiction ww1 soldier book", "body": "Here are my conditions: the soldier must be of the allied forces, it cant be over 350 pages, and he must survive his tour of duty (and preferably not commit suicide at the end either). Other than that it can show every horror of ww1 from mustard gas to trench warfare to shellshocked soldiers.", "comments": ["In Memoriam by Alice Winn ", "Maybe check out *Private Peaceful* and *War Horse* by Michael Morpurgo", "*A Farewell to Arms* by Ernest Hemingway (fiction).\n\n*Three Soldiers* by John Dos Passos (fiction).  The number of pages depends on which publisher you choose. The number of pages ranges between 320 and 362.", "An excellent and sad tale. One of my favs."], "suggested_books": ["In Memoriam", "War Horse", "Private Peaceful", "A Farewell to Arms", "Three Soldiers"], "score": 1, "id": "1jmyni4", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmyni4/historical_fiction_ww1_soldier_book/"}
{"title": "Tween- teen reads", "body": "Suggestions please for your favorite reads or kid’s favorites for my son who is a big MG Leonard fan, but just growing out of them (having also re-read the whole catalogue)….not a fan of fantasy, magical, mythological novels though…. Thank you.", "comments": ["The Vanderbeekers of 141st Street by Karina Yan Glaser\n\nWeirdo by Tony Weaver Jr. \n\nThe Penderwicks by Jeanne Birdsall\n\nExtra Large by Tyler Page\n\nThe Many Mysteries of the Finkel Family by Sarah Kapit\n\nHuda F Are You by Huda Fahmy\n\nZack Delacruz: Me and My Big Mouth by Jeff Anderson\n\nThe Queen of Ocean Parkway by Sarvenaz Tash\n\nIt’s the End of the World and I’m in My Bathing Suit by Justin A. Reynolds\n\nThe Best at It by Maulik Pancholy\n\nHoot by Carl Hiaasen\n\nInvisible by Christina Gonazalez Diaz\n\nGet a Grip Vivy Cohen by Sarah Kapit\n\nPlanet Omar: Accidental Trouble Magnet by Zanib Milan\n\nWelcome Back, Maple Mehta-Cohen by Kate McGovern\n\nEl Deafo by Cece Bell\n\nThe Year My Life Went Down the Toilet by Jake Maia Arlow\n\nFinding Junie Kim by Ellen Oh\n\nThe League of Picky Eaters by Stephanie V W Lucianovic\n\nMiddle School Misadventures by Jason Platt\n\nThe Strange Case of the Origami Yoda by Tom Angleberger\n\nKareem Between by Shifa Saltagi Safadi\n\nStrange Birds: A Field Guide to Ruffling Feathers by Celia Perez\n\nClean Getaway by Nic Stone\n\nAhmed Aziz’s Epic Year by Nina Hamza\n\nDear Student by Elly Swartz\n\nInsignificant Events in the Life of a Cactus by Dusti Bowling\n\nOut There by Seaerra Miller\n\nThe Chance to Fly by Ali Stroker\n\nAn Occasionally Happy Family by Cliff Burke\n\nDoodles from the Boogie Town by Stephanie Rodriguez\n\nMexikid by Pedro Martin\n\nHow to Train Your Dad by Gary Paulsen\n\nRez Dogs by Joseph Bruchac\n\nThe Fabulous Zed Watson by Basil Sylvester", "Wow, this is comprehensive, thank you so much for your time", "Hope you find some good ones!"], "suggested_books": ["The Best at It", "The Year My Life Went Down the Toilet", "Out There", "Clean Getaway", "Finding Junie Kim", "The Penderwicks", "Dear Student", "Planet Omar: Accidental Trouble Magnet", "Mexikid", "Kareem Between", "Hoot", "It’s the End of the World and I’m in My Bathing Suit", "El Deafo", "Middle School Misadventures", "Huda F Are You", "The Vanderbeekers of 141st Street", "Weirdo", "Invisible", "Rez Dogs", "Get a Grip Vivy Cohen", "Welcome Back, Maple Mehta-Cohen", "The Strange Case of the Origami Yoda", "The League of Picky Eaters", "The Many Mysteries of the Finkel Family", "Ahmed Aziz’s Epic Year", "Insignificant Events in the Life of a Cactus", "How to Train Your Dad"], "score": 1, "id": "1jmyir3", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmyir3/tween_teen_reads/"}
{"title": "A book that changed your life", "body": "Greetings! I am coming out of a very hard time in my life. Things are still hard but I’m finally ready to pick up reading again. I’m craving one of those books that leaves you forever changed- be it fiction, biography, historical, fantasy- I love most genres. I’m open to more metaphysical genres as well. A few of my personal favorites are  Catspaw Brave New World Crime and Punishment The mists of Avalon  Mother Earth Father Sky Ready Player One  I really am open to anything though- what books have moved you, enlightened you, or drawn you in?", "comments": ["You might find \"The Hedeby Trials\" by Vincent Kane to be a compelling read. It presents a story with incredibly high stakes involving the potential extinction of humanity. The narrative centers on Rachel's intense personal transformation through a series of trials designed to instill responsibility, endurance, and empathy. These trials occur within a pocket dimension and involve metaphysical and sci-fi elements such as alternate timelines and reality manipulation. The overarching goal is to ensure the survival of Rachel's future son, who is vital to humanity's future. Facing dangerous creatures and a powerful enemy, Rachel's journey explores themes of responsibility and perseverance, potentially offering a thought-provoking experience.", "I loved W Somerset Maugham’s The Razors Edge. Felt like my whole value system was laid out in front of me to see how ridiculous it all is.", "Hmm, out of what you list, I love Brave New World; I really preferred other Dostoevsky's books over Crime and Punishment, but I enjoyed C&P too... just to give an idea of where my recommendations are coming from.\n\nA Little Life by Hanya Yanagihara -- very engaging and easy to read, but also awful things happen in the book; after reading it, first, the book stayed with me and it's one of my favorites... and second, I felt so strongly that, unless one works on their trauma, they'd just stay traumatized for their whole life, they'll be still suffering from their childhood trauma in their old age if they keep on pushing it away and sweeping it under the carpet... and that changed my life in a way that I went to therapy again, because experiencing this book inspired me to actually face my own issues.\n\nMelmoth the Wanderer by Charles Maturin changed my life in a less direct way... as I read through some terrible things that one of the characters lived through, I processed some of my past experiences and got rid of some of my long-lasting shame; this feels like a more personalized influence that I'm not sure would propagate onto others, but the book is great if you're OK with some fancy old English words (that was a bit of a challenge for me as a non-native-speaker, but not too problematic)", "The mushoku tensei light novel series changed my life so much and made me a better person, start going to the gym and eating healthy as well as trying to act better and be nicer and conscious of others’ feelings, I couldn’t recommend it enough"], "suggested_books": ["The Razors Edge", "A Little Life", "Melmoth the Wanderer"], "score": 1, "id": "1jmydyw", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmydyw/a_book_that_changed_your_life/"}
{"title": "Help me spend my 7 Audible credits!", "body": "Long story short, I haven’t checked this account in months and didn’t realize I was paying for a monthly credit. Now I have 7 credits and no particular book I’m excited about.   I know there’s an audiobook sub and I’ll post there too, but I always get the best book recs from this sub so I’m hoping for some great options.  Here are some books/genres/authors I love:  - **Nonfiction: history and politics**. Interwar Europe and later. I have all Michael Short books, and pretty much anything that’s been written about Moussolini, Hitler, and Putin.  - **Nonfiction: space, quantum physics, philosophy**. I love space and the “big” mysteries - the relativity of time, what’s on the other side of black holes, how will the universe die?  - **Nonfiction: Corporate true crime**.  Bad Blood, Empire of Pain, The Big Short, etc.   - **Fiction: Dystopia/apocalypse/post-apocalypse.** If a TV show or movie has been made of the book, I’ve read it (examples: Silo, Wayward Pines, Hunger Games, Handmaid’s Tale, The Stand), but I’d love suggestions for a bit more obscure recs  - **Fiction: Literary masterworks**. Not sure how to describe this one, but books that you think should be considered classic or exceptional because of the writing itself. Examples include The Three Body Problem, American War, books by Ben Winters.", "comments": ["Dungeon Crawler Carl. The audiobook is amazing! The one guy does all the voices, and they are all different. It's insane. ", "You might like the Doris Kearns Goodman’s presidential biographies, “Team of Rivals”(Lincoln) and “Bully Pulpit” (Roosevelt)", "House of Leaves, No Longer Human, The Women, The Push, The Stranger", "Nonfiction... the Warmth of Other Suns by Issabel Wilkerson, the Raj at War by Yasmin Khan, Nella Last's War (Mass observation diaries)\n\nDystopia/Postapocalyptic: the Death of Grass by John Christopher, the Circle by David Egger, the Power by Naomi Alderman, the Chrysalids by John Wyndham, a Canticle for Leibowitz W Miller Jnr\n\nLiterary: Never Let Me Go, Klara and the Sun by Kazuo Ishiguro, the Ministry of Utmost Happiness by Arundhati Roy", "I liked “Trotsky in New York” by Kenneth Ackerman—it’s a good audio book. Straightforward, chronological. It’s less about Trotsky and more about the socialist scene in NYC. Some nice scene setting makes you feel like you’re in some of these lecture halls.", "Shake Hands with The Devil by Romeo Daillaire", "Dystopian: The Broken Earth trilogy by N.K. Jemisin. And the MaddAddam trilogy by Margaret Atwood if you haven’t. I like it better than Handmaid’s Tale \n\nFiction: The Poisonwood Bible by Barbara Kingsolver. Really any Kingsolver, but this one is my favorite.", "The warlord chronicles by Bernard cornwell. An old monk named derfel retells his life’s tale as his chronicles Arthur’s life, set during dark age britian during the saxon invasions.\n\n“These are the tales of the land we call Lloegyr, which means the Lost Lands, the country that was once ours but which our enemies now call England. These are the tales of Arthur, the Warlord, the King that Never Was, the Enemy of God and, may the living Christ and Bishop Sansum forgive me, the best man I ever knew. How I have wept for Arthur”\n\n“But fate, as Merlin always taught us, is inexorable. Life is a jest of the Gods, Merlin liked to claim, and there is no justice. You must learn to laugh, he once told me, or else you’ll just weep yourself to death.”\n\n“I know I have gained Christ and through His blessing I have gained the whole world too, but for what I have lost, for what we have all lost, there is no end to the reckoning. We lost everything”\n\n“Druids are not allowed to write anything down, it’s against the rules. You know that! Once you write something down it becomes fixed. It becomes dogma. People can argue about it, they become authoritative, they refer to the texts, they produce new manuscripts, they argue more and soon they’re putting each other to death. If you never write anything down then no one knows exactly what you said so you can always change it”"], "suggested_books": ["Team of Rivals", "Bully Pulpit", ", the Circle", ", the Chrysalids", ", the Raj at War", ", the Ministry of Utmost Happiness", "Trotsky in New York", "Shake Hands with The Devil", "The warlord chronicles"], "score": 2, "id": "1jmshcz", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmshcz/help_me_spend_my_7_audible_credits/"}
{"title": "looking for an intense horror/mystery/thriller type book", "body": "i have been out of the reading loop for a few years now. i want to get back into it but i have no idea how to find what i'm looking for.  i really love a murder mystery. or just any kind of mystery in general. but i like ones that are very intense and go all in. my problem is that i will read reviews and people will say it was scary but then to me it wont be. i watch mainly horror movies so maybe thats my problem lol.   honestly even if its not a mystery and more just horror im okay with that too.   so if anyone knows any books that are actually scary and intense please let me know.", "comments": ["You’re like me you’ve been more desensitized to that genre just by way of always consuming it. \n\nI’ve watched almost every self proclaimed scary movie under the sun so much so that I can pretty much predict the ending lol but I still can enjoy it for what it is \n\nBut, check out The Troop by Nick Cutter (just a warning its pretty graphic) \n\nA friend of mine recently suggested The Whisper Man by Alex North \n\nGood luck!\n\nEdit: words", "I recommend these as someone who is also not scared by pretty much any book. They may not terrify you, but they're great stories:\n\n\n- Malice House (and its sequel, Midnight Showing) by Megan Shepherd\n- The Shining by Stephen King\n- The Hollow Kind by Andy Davidson\n- The Silent Companions by Laura Purcell\n- The Hollow Places by T. Kingfisher ", "Persona by Vincent Kane was a very intense read for me. It falls into all the Genres you've listed.", "Summit Lake by Charlie Donlea \n\nThe Inmate by Freida McFadden \n\nThe Guest List by Lucy Foley \n\nThe Girl in the Ice by Robert Bryndza \n\nChoose Me by Tess Gerritsen by Gary Braver", "I would suggest Catriona Ward. She does horror with mystery elements and I've liked everything I've read from her so far. When I started getting back into reading she was one of the first authors I read and she helped reignite my love of reading. \n\n\nI'm not going to say you'll be scared by her work, I wasn't, but I think the writing is so engaging it won't matter. \n\n\nYou might also try \"I'm thinking of Ending Things\"by Iain Reid. It's a short but bizarre read. ", "This may sound like it's coming out of left field, but I promise you won't be mad about it. The Devil in the White City by Erik Larson. True crime about a series of murders that happened in the time surrounding the Chicago World's Fair. Not only is the killer absolutely heinous, but the time period itself is fascinating. It gets in your head because it actually happened. There's so much fascinating detail.", "Yes! Although I didn't super care for The Troop, just not the type of horror I like, I would definitely recommend reading it if you like horror. ", "lol yep i can almost always predict whats going to happen, which honestly doesnt bother me because i care more about the substance of the book. \n\nthank you! those both sound very interesting", "oh i just looked it up and will for sure be putting in on my to read list! thank you!", "oo i've never heard of any of these so i am very excited to look into them thank you!"], "suggested_books": ["The Whisper Man", "- The Silent Companions", "- The Shining", "- The Hollow Kind", "Summit Lake", "The Inmate", "The Girl in the Ice", "Choose Me", "The Guest List", "I'm thinking of Ending Things"], "score": 1, "id": "1jmxe0o", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmxe0o/looking_for_an_intense_horrormysterythriller_type/"}
{"title": "Wlw enemies to lovers or arranged marriage/marriage of convenience books?", "body": "I have read Tryst six venom btw. So the only requirement is the hatred doesn't stem from petty reasons, misunderstandings - it should be an actual conflict or serious dilemma -(I have read Tryst six venom btw)  And the second rec is for any kind of wlw arranged marriage or marriage of convenience situation (they don't have to be enemies to lovers) even fake dating (something like the fiancee farce) would work!  Thanks in advance!!!", "comments": ["I haven't read it yet but Alexandria Bellefleur has a fake-dating book called Written in the Stars."], "suggested_books": ["Written in the Stars"], "score": 0, "id": "1jmxc9p", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmxc9p/wlw_enemies_to_lovers_or_arranged/"}
{"title": "I need a queer (preferably mlm) book that's emotionally gripping and has a happy ending.", "body": "I've just finished Red,White and Royal blue and it made me very happy. I need more of that.  Really appreciate your suggestions <3", "comments": ["I can’t suggest a book, but I CAN suggest an online library!\n\nhttps://www.queerliberationlibrary.org", "*The Charm Offensive* by Alison Cochrun", "Maybe *The House in the Cerulean Sea* and it's sequel *Somewhere Beyond the Sea* by TJ Klune would work for you!", "I need to read more books that fit this too, but I'll drop a couple on my tbr list that might interest you since you don't have many recs yet. (Definitely gonna stick around hoping people have more suggestions too!)\n\nAnd They Were Roommates by Page Powars, TJ Klune's books (Under the Whispering Door, The House in the Cerulean Sea etc), Boyfriend Material by Alexis Hall and The Charm Offensive by Alison Cochrun.", "Boyfriend Material by Alexis Hall\n\nYou can also search romance.io by keyword and spice level & if you scroll down on the first page you can also type in the title Red, White, and Royal Blue and it will suggest similar books\n\nRecs from r/MM_RomanceBooks:\n\nhttps://www.reddit.com/r/MM_RomanceBooks/s/MJdUTVv2RA\n\nRecs from r/RomanceBooks:\n\nhttps://www.reddit.com/r/RomanceBooks/s/kfeWAOytYw\n\nhttps://www.reddit.com/r/RomanceBooks/s/LTx0AEXYDG", "You have to read SURFACING by Daniel Stephens. I freaking loved it.", "I just read Under the Whispering Door - it was not for me but the gay romance is very sweet.", "We Could be So Good by Cat Sebastian\n\nYou & Me by Tal Bauer — the sweetest m/m romance I’ve ever read I love it so much (A lot of Tal’s books are swoon worthy) \n\nPeter Darling by Austin Chant \n\nCaptive Prince trilogy by CS Pacat (mind TWs)", "It's YA, but *Aristotle and Dante Discover the Secrets of the Universe* by Benjamin Alire Sáenz is excellent and totally fits the bill.", "Bellies by Nicola Dinan"], "suggested_books": ["The Charm Offensive", "The House in the Cerulean Sea", "Somewhere Beyond the Sea", "And They Were Roommates", "Boyfriend Material", "Peter Darling", "We Could be So Good", "Aristotle and Dante Discover the Secrets of the Universe"], "score": 0, "id": "1jmwwhy", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmwwhy/i_need_a_queer_preferably_mlm_book_thats/"}
{"title": "16 hour flight tomorrow. What should I read?", "body": "Prefer science fiction, but I'm open to anything fictional. Thanks!", "comments": ["11.22.63 by king", "Children of Time by Adrian Tchaikovsky", "The safety instructions", "The Sirens of Titan by Kurt Vonnegut", "Shutter island by Dennis Lehane", "piranesi\n\nProject hail Mary\n\nHyperions", "Dungeon Crawler Carl", "The God of the Woods by Liz Moore just got me through an 11-hour flight.", "Red Rising!!!!", "Replay by Ken Grimwood"], "suggested_books": ["Children of Time", "The Sirens of Titan", "Shutter island", "The God of the Woods", "Replay"], "score": 17, "id": "1jmg938", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmg938/16_hour_flight_tomorrow_what_should_i_read/"}
{"title": "I want a book that is like the show Killing Eve!", "body": "I loved 7 husbands of Evelyn Hugo because it wasn’t just straight romance I liked the wlw aspect. I also loved that it put me in a whole different world.  I loved Billy Summers because of the crime mixed with fiction, it kept me interested and was just dark enough.  I loved the TV show killing eve for the characters and the wlw aspect but it wasn’t the whole show. It was also a little dark which I liked.  I also liked the hunger games, for the female lead and the dystopia of it.  I think I’m looking for something that isn’t straight people romance, but also isn’t dragons or fairies. I want to get attached to the characters and completely enthralled in their lives. I don’t do well with books that go slow, I lose interest. Please help me out!", "comments": ["killing eve is originally a book series.  codename villanelle.", "I haven't watched killing eve yet though I want to, but a book I love that's also wlw romance where they were supposed to kill each other is This is how you lose the time war by El Mothar and Gladstone", "Mark Burnell's Stephanie Patrick series, beginning with The Rhythm Section", "I rec the following wlw books that have dark aspects to the romance- \n\nRequim for immortals by Lee winter- assassin wlw \n\nSunburn by Chloe Michelle Howarth - religious trauma wlw story set 1900s\n\nSerpentine Valentine by Giana Darling- wlw, revenge story surrounding SA \n\nThe Lay of you by Corrie Mackay -cult backstory and amazing writing \n\nCharon docks at daylight by Zoe Reed and Hearing red by Nicole Masser - wlw + dystopian! v long tho", "Yeah I haven’t heard the best things about the books, I also would rather read women written by women if that makes sense. I started “1st to die” but didn’t like that it was written by a man focusing on female relationships", "thanks for giving billy summers a shout out, btw.  i just started it and it's awesome.  love those books where you can tell early on that you're in for a great story."], "suggested_books": ["The Rhythm Section", "Sunburn", "Charon docks at daylight", "1st to die"], "score": 4, "id": "1jmomuj", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmomuj/i_want_a_book_that_is_like_the_show_killing_eve/"}
{"title": "Looking for fictional road trip novels", "body": "Not travel memoirs, fictional stories. I'd prefer less romance, too.", "comments": ["I'm Starting to Worry About This Black Box of Doom by Jason Pargin", "The Lincoln Highway by Amor Towles", "I liked \"Into the Beautiful North\" by Luis Alberto Urrea. The characters aren't taking a trip just for the fun of it, they're trying to get from Mexico into the United States. A road trip is part of it, and the whole book is a travel story.", "*Sing, Unburied, Sing* by Jesmyn Ward"], "suggested_books": ["I'm Starting to Worry About This Black Box of Doom", "The Lincoln Highway", "Into the Beautiful North", "Sing, Unburied, Sing"], "score": 2, "id": "1jmpkhs", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmpkhs/looking_for_fictional_road_trip_novels/"}
{"title": "Post-Post Apocalypse Subgenre? CE 2,300+ Onwards", "body": "I love post-apocalyptic worlds. I played the video game Fallout 3 around age eight and since then I've been hooked. *The Road* by Cormac McCarthy is one example of a good post-op genre book I thoroughly enjoyed. Omar El Akkad's *American War* is another great example of utilizing the genre's talent of criticizing today's problems from a bitter, post-modern edge to the lore and the protagonists' struggles.   This week, I want to try reading post-post apocalyptic books. The age of rebuilding society bit by bit, the overcoming of the zombie apocalypse or at least the twilight years of it. Or an antiquity age of the dark age before, maybe hinted at through dialogue or small breadcrumbs to the discerning loreslueth. The Fallout New Vegas experience, in other words.  TL;DR Please send me late post-apocalyptic or post-post apocalyptic book suggestions please. Thank you for reading!", "comments": ["The Passage Trilogy by Justin Cronin seems to fit the bill. \n\nAlso my mom highly recommended Earth Abides to me. She loves sci-if, new world books. I still haven’t read it, but will someday.", "_Against the Fall of Night_ by Arthur C. Clarke\n\nIt’s been a long time since I’ve read it, but it takes place on Earth millions of years in the future and it’s a take on the ‘surface-level utopia’ which I really enjoy.", "Metro 2033 is a few hundred years off but the Metro 2033 game is similar to fallout and the game is based on the book\n\nSilo series", "The Wheel of Time, Jordan \n\nShannara, Brooks (after the retcon) (I am only aware of said retcon because of the show 🤮)\n\nBattle Circle, Anthony\n\nDancers at the End of Time, Moorcock\n\nSaga of the Forgotten Warrior, Corriea (possibly on a planet settled by humans, then decended a few ages)\n\nThe Time Machine, Wells", "Zone One by Colson Whitehead\n\n\"A virus has laid waste to civilization, turning the infected into flesh-eating and mortally contagious zombies. But events have stabilized, and the rebuilding process has begun.\"", "In terms of the quality of the writing it's not on the same level as McCarthy, but ***Warday*** by Whitley Strieber and James Kunetka is an interesting read. \n\nThere's also ***Z For Zachariah*** by Robert C. O'Brien. It's essentially a young adult novel, but it's a fun read. \n\nThen you have Nevil Shute's ***On the Beach***, another good one. \n\nA bit unconventional, but wonderfully rich prose - Will Self's ***The Book of Dave***. Difficult, dense, and a challenging read, but well worth it.", "The Book of Koli, a few hundred years post apocalypse", "Wittgenstein’s Mistress is about the last person left on earth.", "[Dr. STONE](https://www.viz.com/dr-stone) is about a science prodigy setting out to restore scientific progress after a mysterious wave turned humanity into stone.", "A Canticle for Leibowitz. It is a very clear influence on the Fallout series."], "suggested_books": ["The Passage Trilogy", "_Against the Fall of Night_", "Zone One", "Warday", "On the Beach", "The Book of Dave", "The Book of Dave*", "Z For Zachariah", "The Book of Koli"], "score": 9, "id": "1jmhcqq", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmhcqq/postpost_apocalypse_subgenre_ce_2300_onwards/"}
{"title": "What is your favorite children’s book??", "body": "Mine is definitely The Book of Shadow Boxes by Laura Seeley. The illustrations remind me of my favorite book store that smells like old books and incence with a three legged cat coming up to you for belly rubs 💚", "comments": ["There’s a Monster at the End of This Book", "Anything by Roald Dahl\n\nThe Little Prince", "Stellaluna 🦇", "The Phantom Tollbooth.", "Where The Wild Things Are!", "Dragons Love Tacos", "Charlotte’s Web", "The Velveteen Rabbit", "For younger ones, it's  Charlotte's Web. \nFor older ones, it's Holes by Louis Sachar.", "This is such a hard question, but the first ones that come to mind are Owl Babies and The Book With No Pictures"], "suggested_books": ["The Velveteen Rabbit"], "score": 38, "id": "1jm9dop", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jm9dop/what_is_your_favorite_childrens_book/"}
{"title": "Suggest me \"slice of life\" books, please", "body": "I recently found out about *Slice of Life*, and I started by watching films like *“Past Lives”* and *“Perfect Days.”* I'm usually more of an action/thriller type of guy, but I loved the peacefulness of these works. It got me wondering if there are any books out there that fit the “genre.” I've only read science fiction and epic fantasy, so I'm looking for books that are more about life, books that could inspire me to *live*, like those two films I mentioned previously have done.  Hopefully my question isn't weird. If it is, then I'm sorry. I just don't know where to find books like this. I haven't really seen any posts on Reddit about this, and Google has only been helpful for films.", "comments": ["Just recommended this audiobook, but I enjoyed The Dutch House by Ann Patchet. I also enjoyed another of her books, Tom Lake. Preferred the former, felt more mature to me.", "I find a lot of Haruki Murakami to be really peaceful to read - it's generally seen as magical realism so there may be some surreal or fantastical elements, but so much of his writing is just slice of life moments. Like he'll spend several pages talking about how a character prepared dinner for one while listening to jazz and pondering some obscure/seemingly arbitrary thought. It might sound boring on the surface but his writing just draws you in. (Well, me, at least.) \n\nThe first book of his I read was \"A Wild Sheep Chase\" and it got me hooked. Would also recommend \"After Dark\" which takes place over the course of one night and delves into the lives of several individual people crossing paths at a metropolitan diner.", "Stoner 🩷", "Welcome to the Hyunamdong Bookshop\n\nThe Kamogawa Food Detectives", "I found “An Accidental Tourist” by Anne Tyler a few days ago on Audible’s Plus catalog. It’s masterfully read by Jefferson Mays. It’s a story about a married couple having marriage problems and separate after their son was murdered, and the man struggles to find new meaning and fulfillment in his overly structured world\n\nIt’s set in Baltimore in the mid 1970’s.", "\\- *Empire Falls* by Richard Russo\n\n\\- *A Gentleman in Moscow* by Amor Towles\n\n\\- *Convenience Store Woman* by Sayaka Murata", "\n\n\n\nBefore The Coffee Gets Cold by Toshikazu Kawaguchi \n\nA Man Called Ove by Fredrik Backman\n\nNormal People by Sally Rooney", "I really enjoyed Sweet Bean Paste by Durian Sukegawa a Japanese author. It’s a quick and easy read with a heart warming message.", "Oh and the first 2/3 of Stephen king’s fairy tale was actually really lovely. The ending gets weird, though.", "Sourdough by Robin Sloane"], "suggested_books": ["After Dark", "An Accidental Tourist", "A Gentleman in Moscow", "Convenience Store Woman", "Empire Falls", "Normal People", "A Man Called Ove", "The Coffee Gets Cold", "Before The Coffee Gets Cold", "Sourdough"], "score": 17, "id": "1jmdcjp", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmdcjp/suggest_me_slice_of_life_books_please/"}
{"title": "Recommendations. Kindly suggest a book.", "body": "My boyfriend and I have decided to read books since we both love to read. We have decided to read st at least one book a month. We want to start with comedy. We will be glad if we could have some recommendations and options.Thanks", "comments": ["The Princess Bride by S. Morgenstern (good luck finding the unabridged version, though)", "There’s the classic Hitchhikers Guide to the Galaxy! And I’ve heard good things about Good Omens by Terri Pratchett, but it’s still on my TBR!", "The Villains Assistant was a funny, slightly romantic comedy about a young woman who gets hired as a master villain’s personal assistant. Set in a medieval/fantasy realm.", "Interior Chinatown by Charles Yu made me laugh! And also made me introspect. Always a fav of mine", "Small Miracles by Olivia Atwater", "Three Men in a Boat by Jerome K Jerome", "I enjoyed 'The humans' by Matt Haig", "Murder Your Employer by Rupert Holmes", "Janet Evanovich's *Stephanie Plum* novels.", "i know of no comedy books to suggest, as my boyfriend and i have our own book club and focus on coaching or self help books. my suggestion when you read this genre is the gifts of imperfections by brene brown. happy reading!"], "suggested_books": ["Interior Chinatown", "Three Men in a Boat", "Murder Your Employer"], "score": 2, "id": "1jmnxjm", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmnxjm/recommendations_kindly_suggest_a_book/"}
{"title": "Which book should I read?", "body": "I am thing of buying a book and I have two books in my mind 1-The Notebook and The Kite Runner. Can y'all suggest me which book to read first? Thank you!", "comments": ["The Kite Runner, absolutely!", "This is wild cause these are two of my favorites. \nThe answer is The Kite Runner, then read A Thousand Splendid Suns and The Mountains Echoed. \nHosseini has a remarkable way of weaving characters and plot lines so beautifully.", "I would also say kite runner", "I vote for the Kite Runner!!", "The Kite Runner, hands down. It’s an emotionally powerful story about friendship, betrayal, guilt, and redemption. The themes are deep, the storytelling is gripping, and it leaves a lasting impact. While The Notebook is a sweet romance, The Kite Runner offers a much richer and more thought-provoking experience. I read it over ten years ago and STILL think about it.", "Thanks man!", "Thanks for the suggestions! I was really confused.", "Couldn‘t agree more. I‘ve been struggling to really keep with a book lately, but when I read A Thousand Splendid Suns I just could not stop reading. So beautifully and carefully written."], "suggested_books": ["The Kite Runner", "The Kite Runner"], "score": 1, "id": "1jmrjs6", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmrjs6/which_book_should_i_read/"}
{"title": "Exploring Japanese culture from foreigner's perspective books", "body": "I love books that explore Japan and Japanese culture, especially historical fiction or love stories between Japanese and westerners. I'm looking for more books like: Winds of Mitamura by John Ball,  Miss One Thousand Spring Blossoms by John Ball,  Shogun by James Clavell,  Memoirs of a Geisha by Arthur Golden,  Sayonara by James A. Michener.  Even liked Abroad in Japan by Chris Broad even though it's not fiction and more autobiographical.", "comments": ["Ian Buruma, *A Japanese Mirror* (nonfiction about modern Japanese culture).\n\nAlan Spence, *The Pure Land* (historical novel about Thomas Blake Glover).", "The Teahouse Fire by Ellis Avery – >!An American orphan gets swept into Kyoto’s tea ceremony world in the 1800s. Forbidden love, rich historical setting.!<\n\nThe Samurai’s Garden by Gail Tsukiyama – >!Quiet, introspective story about a Chinese man healing in a Japanese village pre-WWII. Beautifully written.!<\n\nThe Thousand Autumns of Jacob de Zoet by David Mitchell – >!Dutch clerk in 18th-c Nagasaki falls for a Japanese midwife. Big Shogun vibes, very layered.!<\n\nCloud of Sparrows / Autumn Bridge by Takashi Matsuoka – >!Epic samurai-era tales with missionaries, mysticism, and romance. Like Shogun, but faster-paced.!<\n\nA Pale View of Hills by Kazuo Ishiguro – >!Subtle and haunting, set in post-war Nagasaki. Not romance-heavy, but good cultural contrast and atmosphere.!<\n\nAn Artist of the Floating World by Ishiguro – >!Post-WWII Japan from a Japanese artist’s perspective grappling with change. Deep and reflective.!<", "Silent Honor by Danielle Steel maybe? \n\nIt explores Japanese and Japanese American cultures right before the start of WWII, including the internment camps. The main love story is between a Japanese woman and an American man. ", "Marguerite Durras: Hiroshima mon Amour\n\nMuriel Barbery: a Single Rose", "Dogs and Dragons. Good but forgot authors name."], "suggested_books": ["A Japanese Mirror", "The Pure Land", "The Pure Land*", "The Samurai’s Garden", "The Thousand Autumns of Jacob de Zoet", "The Teahouse Fire", "An Artist of the Floating World", "A Pale View of Hills", "Silent Honor"], "score": 1, "id": "1jmrfxx", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmrfxx/exploring_japanese_culture_from_foreigners/"}
{"title": "Astrophysics books for non-astro physicist", "body": "hii, i am very interested in reading more on the formation of the solar system, the planets, stars, constellation and i am wondering if there are book recommendations for beginners not in this field of study? thank you in advance!!!", "comments": ["Astrophysics for People in a Hurry. (Neil de Grasse Tyson)", "After you've gotten a handle on the beginning, a next logical step is to investigate the ending.\n\n**The End of Everything (Astrophysically Speaking)** by Dr. Katie Mack is an easy read on cosmology. It might be one step above introductory though (I've read too much and can't decide).", "Another Neil deGrasse Tyson book suggestion: \"Merlin's Tour of the Universe\".", "I second this, and would add *Astrobiology* by Plaxco and Gross for the related topic of how life might develop in the universe."], "suggested_books": ["Merlin's Tour of the Universe", "Astrobiology"], "score": 1, "id": "1jmr5pl", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmr5pl/astrophysics_books_for_nonastro_physicist/"}
{"title": "Books about old organisations/cities made new suggestions", "body": "I'm after a series that focuses on a organisation/city/nation that was previously powerful or in its prime but has suffered a loss of power/people/cause or a slow winding down of its abilities but then through a new discovery or new character, can rebuild and rediscover it's purpose and grow.  Examples would be the Rivers of London series or Ankh-Morpork over the Discworld series.   Thanks", "comments": ["Witch king by Martha Wells"], "suggested_books": ["Witch king"], "score": 1, "id": "1jmqvh9", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmqvh9/books_about_old_organisationscities_made_new/"}
{"title": "Laura Ingalls Wilder vibes", "body": "Looking for suggestions on books that are similar to the Little House series by Laura Ingalls Wilder. Or anything that takes place in North America in the 1700 and 1800s.", "comments": ["O Pioneers and My Antonia by Willa Cather", "Caddie Woodlawn was a similar book I read as a kid around the same time as Little House on the Prairie with similar setting and characters! Loved it!", "Sarah, plain and tall by Patricia Maclachlan", "“The Orphan Train” by Christina Baker Kline. Historical fiction.  Composite characters. \n\n“A Girl Called Samson” by Amy Harmon. Historical fiction.  Based on a true character story with some embellishments to fill missing gaps. Author explains gaps at the end. \n\nYou might also be interested in “The World of Laura Ingalls Wilder” by Marta McDowell. Biographical, informative.\n\nAll above were great audiobooks.", "Prairie Fires by Caroline Fraser is a biography of Laura Ingalls Wilder, it won a Pulitzer Prize and was really interesting. Did a good job explaining general conditions and history of the time period too, helpful context for the little house books.", "*The Birchbark House* books are very similar to *Little House* in terms of vibes, but they have Ojibwe protagonists.", "Little House on Rocky Ridge is the first in a series based on Rose Wilder's childhood (Laura's daughter).", "If you're not specifically looking for kids/YA books, look at Sara Donati's Wilderness series.", "It's essentially a young adult novel, and relatively unknown and not widely read at all, but a book that has stayed with me since boyhood is ***White Water, Still Water*** by J. Allan Bosworth. \n\nAnother book that fits the bill is ***The Last of the Mohicans*** by James Fenimore Cooper.", "If you’re interested in more about Laura, I read a non-fiction book about a woman who visited all of the Laura Ingalls Wilder sites. It’s called The Wilder Life by Wendy McClure."], "suggested_books": ["Sarah, plain and tall", "“The Orphan Train”", "The World of Laura Ingalls Wilder", "The Orphan Train", "Prairie Fires", "Little House", "The Birchbark House", "The Last of the Mohicans", "White Water, Still Water", "The Wilder Life"], "score": 2, "id": "1jmm0v2", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmm0v2/laura_ingalls_wilder_vibes/"}
{"title": "Freedom from Control", "body": "I'm looking for something like The Truman Show or The Giver. Where someone lives in a manufactured reality or \"utopia\" that they escape from or learn about.   I prefer novellas or shorter novels.", "comments": ["*Amatka* by Karin Tidbeck is in the same vein as *The Giver*.", "The Ferryman by Justin Cronin. \n\nI don’t see it get mentioned on Reddit much, but it’s a lovely book from 2023, and the plot with still send you a number of twists despite it being a recommendation to your (potentially plot-compromising) question.", "[Running Out of Time](https://en.wikipedia.org/wiki/Running_Out_of_Time_(novel)) by Margaret Peterson Haddix (184pp)", "i know you said novellas/short novels but if youre at all open to manga, Promised Neverland by Kaiu Shirai fits well", "It's a two book series but >!*Shades of Grey* series by Jaspar Fforde. Nothing like 50 shades.!<", "The Stepford Wives by Ira Levin\n\nLogan's Run by George Johnson and William Nolan", "This looks perfect. Thank you!", "Looks interesting. Thank you!", "I have the anime on my to watch list, actually. Thanks!", "I’ve been waiting for an opportunity to recommend it, so thank you! I missed where you mentioned preferring novellas, so I would warn that I think I remember it being 300+ pages. Would to hear your thoughts if you do read it’"], "suggested_books": ["Amatka", "The Giver", "*Amatka*", "The Ferryman", "Shades of Grey", "The Stepford Wives", "Logan's Run"], "score": 2, "id": "1jmlxhm", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmlxhm/freedom_from_control/"}
{"title": "Suggest me a book you read solely because of its cover.", "body": "They say don’t judge a book by its cover. Personally I’ve picked up random books at the library and read them simply because the cover was interesting.  The latest was Good Morning, Monster: A Therapist Shares Five Heroic Stories of Emotional Recovery by Catherine Gildiner.  Give me your book suggestions.", "comments": ["*The Secret History*, Donna Tartt. I saw an early edition on a discount shelf not long after it had been published and liked the cover and design. I had it on one of my overflow shelves for decades before seeing it had become a bit of a modern classic and finally read it.", "When I was in college, our bookstore had great book sales. I had a bit of disposable income so I'd treat myself every once in a while. So I bought a book because the cover was pretty. I liked it, so I recommended it to a few friends. \n\n\nThat book was Twilight.", "Literally got [this](https://www.amazon.com/Things-Gotten-Worse-Since-Spoke/dp/1951658124) book because of the cover. It's not bad exactly, but not as great as I was expecting based on a few reviews I heard. (be warned the cover is a little bloody, lol)", "The Windup Girl by Paolo Bacigalupi. Good book!", "Look Who’s Back by Timur Vermes. Whoever designed that cover deserves an award.", "The Mountain in the Sea by Ray Naylor\n\nStarter Villain by John Scalzi", "The Ethical Assassin by David Liss", "FOURTH MANSIONS by R.A. Lafferty.  It's had a lot of different jacket designs over the years, but the one that caught my eye was the one with an alien-looking personage with a swelled-up head who seemed to have marionette strings reaching down from its fingertips, as if it were using someone as a puppet... https://www.ebay.com/itm/256610641159?mkcid=16&mkevt=1&mkrid=711-127632-2357-0&ssspo=6PqM0qtPT3u&sssrc=4429486&ssuid=jZSrEFGRRr2&var=&widget_ver=artemis&media=COPY", "The Martian by Andy Weir\n\n\nRead it before the movie was in production. Though it was going to be an alien book", "Tiger Lily by Jodi Lynn Anderson. The cover with the girl's body draped in gauzy orange fabric. \n\nTurns out that outfit is not something our heroine would ever wear, but this became one of my favorite books of all time anyway."], "suggested_books": ["The Secret History", "The Windup Girl", "Look Who’s Back", "The Mountain in the Sea", "Starter Villain", "The Ethical Assassin", "The Martian", "Tiger Lily"], "score": 21, "id": "1jm9y3e", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jm9y3e/suggest_me_a_book_you_read_solely_because_of_its/"}
{"title": "Best book to learn more about fascism", "body": "Can you recommend to me a book to learn more about fascism? Looking for something fairly engaging, as balanced and objective as possible, and I would particularly like to understand better the draw of why it is compelling.", "comments": ["*The Origins of Totalitarianism* by Hannah Arendt is not precisely objective, but interesting nonetheless for her perspective as a survivor.", "The Anatomy of Fascism by Robert Paxton", "Fascism: The Story of an Idea by Ian Dunt and Dorian Lynskey is a good and readable overview", "Jason Stanley-How Fascism Works ", "There's no such thing as an objective book, but *Blackshirts and reds* by Michael Parenti provides a great introductory overview and is very engaging.", "*Varieties of Fascism: Doctrines of Revolution in the Twentieth Century* by Eugen Weber.\n\n*The True Believer: Thoughts on the Nature of Mass Movements* by Eric Hoffer.", "Doctrine of Fascism", "Fascism is really more of a leftist political trope than a real thing.  A political lure, to unite haters.  And what's most weird about it is, it unites haters by accusing others of hatred.  \"Look at them, they hate the Jews, they must be fascist!\"  \"Look at them, they hate immigrants, they must be fascist!\"  Et cetera.  So justifying hatred on the left by suggesting it -- irrespective of reality -- on the right.\n\nIn order to face reality, you need to understand that fascism has a great deal in common with many other so called socially constructed topics.  Democracy, intelligence, racism, the list is long.  And what all these topics have in common is:  you can't tell what they are without studying them, and you can't study them without first knowing what they are.\n\nIt's a dilemma.  How do you study fascism without first knowing what it is?  How do you know you studied the right thing?  But how could you ever find out what it is without first studying it?\n\nI don't think social scientists have ever faced this issue directly or straightforwardly.  Although, if you'd like an example of how to face a similar issue directly, I think there's a 20th anniversary or 25th anniversary edition of The Bell Curve that tries to do that, with intelligence.  (Oddly, the book has a great deal to say about racism, and never once do the authors seem to notice that it, too, carries with it the same dilemma.)\n\nAnother very interesting characteristic of these so called socially constructed topics is, in order to be real they must be topics about which we must be able to be mistaken.  Or to put it another way, if a topic is real by definition it doesn't exist in the world, but only in our heads.  To be real in the world it must be something about which we may not have seen everything it has to offer us.\n\nI'm sadly not enough of a philosopher to be able to explore that idea more carefully, but let's imagine that we have investigated the evidence and decided, one and all, that fascism is a real thing, out in the world.  The evidence, as they say, is conclusive.  Now.  If it's a real thing, it must also be something about which we might be mistaken.  That's how you really know it's real, is if you had to change your mind about what it was, while you studied it.  Right?  So if you had to change your mind about it once, how do you know there aren't a hundred or a thousand other tests, which you could run but haven't thought of (much less executed) which would change your conception of it just as much if not more?\n\nAnd for all I know, one or many of these tests we haven't even thought of yet might convince us that it's actually NOT a real thing in the world, but contained entirely in our heads.  Right?  We don't know.  We haven't done the tests.\n\nThe bottom line, for me, is:  don't expect to understand it.  You can learn what people think they mean by the word... but I don't think you can know much more than that.", "I'm reading this right now it's excellent"], "suggested_books": ["The Origins of Totalitarianism", "Blackshirts and reds", "The True Believer: Thoughts on the Nature of Mass Movements"], "score": 0, "id": "1jmqcl3", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmqcl3/best_book_to_learn_more_about_fascism/"}
{"title": "I've a huge baby fever rn, suggest me a book with cute babies in it, motherhood, family etc", "body": "Like I've a huge baby fever right now. I searched up this a lot, but almost all book recs that i check out about babies, children, pregnancy, mothers or motherhood or simply about family is about the negative experiences, the body horror of it all, misogyny, fucked up family dynamics, horrible husband, evil psychopathic children, narcissistic mothers etc.   So please do recommend me books with positivity in it!! With cute little children and the ups and downs of being a mother, or even a father.   I'm up for books with good and helathy family dynamics with older children or teenagers even, like that movie \"Mummy\"!! Like a family on an adventure.  Also please note,I DON'T want to read about how horrible and risky and awful pregnancy and childbearing and motherhood is for women.   I'm up for all genre, except horror NOTHING LIKE PET SEMETERY, although that would appreciate now I'm also wanting to read that \"Family in an action or adventure sequence\" Thing like in Mummy franchise and that one Movie of Indiana Jones.   Thank you!!", "comments": ["This Is How It Always Is by Laurie Frankel. It’s not without conflict, but I related so much to just wanting to do right by your child, whatever they’re going through.", "Cheaper by the dozen by Ernestine Gilbreth Carey is a fun read about a family with 12 kids.", "The fantasy series books of the Raksura by Martha Wells\n\nTo know in what book they have kids or where they are at in that sense: book 1 >!main couple adopts kids at the end!< book 3 >!They are worried ability fertility trying to get pregnant!< short story books 4 and 5 >!they get pregnant and have babies!< books 6 and 7: >!All kids grow up!<\n\nI love this series it's one of my absolute favorites and I think it's the vibe you're looking for. It's fantasy creatures but human like", "Rosemary’s Baby", "I'll check it out, thank you!!!", "Lol no", "OP do not read this, you won't like it", "Thank you for the suggestion but as I mentioned in the post, I'm not looking for a horrible husband/father and horror being the exception to the genres.", "I know. I've read it and couldn't complete the book lmao. Thank you for the heads up tho!"], "suggested_books": ["This Is How It Always Is"], "score": 2, "id": "1jmqakt", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmqakt/ive_a_huge_baby_fever_rn_suggest_me_a_book_with/"}
{"title": "Suggest me an adventure book with dinosaurs for a 10 year old", "body": "Hi everyone, my son loves dinosaurs and has read every “encyclopedia” type book we can find but he’s wanting to read more things like Jurassic park or even magic tree house with dinosaurs, if it’s a series even better.  Please help", "comments": ["Have you read *Dinotopia*? Beautifully illustrated series where a father and son are shipwrecked on an island where dinosaurs and humans coexist. The books are written like the father's naturalist notebooks.", "Cryptid Hunters", "Dactyl Hill Squad by Daniel José Older—my kid likes this one. Dinosaurs, American Civil War history, adventure!", "The Edge of Extinction Series by Laura Martin", "The Shy Stegosaurus of Cricket Creek by Evelyn Sibley Lampman. An older book so it might be hard to find, but a classic.", "I was going to suggest magic tree house. Maybe check out the American chiller books? Seems like I remember a dinosaur one at some point.", "Animorphs Megamorphs 2: In The Time of Dinosaurs\n\nAnd then if he likes the characters/concept, there’s a whole series of non-Dino books for him to read.", "Dinosaur Detectives by Judith Bauer Stamper\n\nTyrannosaurus Wrecks by Stuart Gibbs\n\nDodging Dinosaurs by Wendy Maas\n\nMoon Girl and Devil Dinosaur by Stephanie Williams\n\nDinosaurs Before Dark by Mary Pope Osborne\n\nOona Finds an Egg by Adele Griffin\n\nDactyl Hill Squad by Daniel Jose Older\n\nHow to Hog Tie a T-Rex by Will Dare\n\nThe Talking T-Rex by Ron Roy\n\nDon’t Disturb the Dinosaurs by Ada Hopper\n\nThe Enormous Egg by Oliver Butterworth\n\nDino Lab by Anson Montgomery\n\nKnights vs. Dinosaurs by Matt Phelan\n\nDigging for Dinos by Jessica Young\n\nT-Rex vs Robo Dog 3000 by Scott Nickel\n\nDinosaur Trouble by Dick King Smith\n\nThe Mystery of the Stolen Dinosaur Bones by Gertrude Chandler Walker\n\nDinosaur Disaster by David Lubar\n\nThe Test of Time by Geronimo Stilton\n\nThe Secret Explorers and the Jurassic Rescue by SJ King\n\nThe Christmasaurus by Tom Fletcher", "We have not, I’m going to put that on the list. He hasn’t read any outside of Jurassic Park and the magic tree house ones, if you know more please tell me.", "Thank you putting that on the list too"], "suggested_books": ["Dinotopia", "Dactyl Hill Squad", "The Shy Stegosaurus of Cricket Creek", "Don’t Disturb the Dinosaurs", "The Mystery of the Stolen Dinosaur Bones", "Oona Finds an Egg", "Dinosaur Detectives", "The Christmasaurus", "Dinosaur Trouble", "Dinosaurs Before Dark", "Dactyl Hill Squad", "Digging for Dinos", "Moon Girl and Devil Dinosaur", "How to Hog Tie a T-Rex", "Dino Lab", "Tyrannosaurus Wrecks", "Dinosaur Disaster", "The Secret Explorers", "T-Rex vs Robo Dog 3000", "Knights vs. Dinosaurs", "The Talking T-Rex", "Dodging Dinosaurs", "The Enormous Egg", "The Test of Time"], "score": 2, "id": "1jmldnf", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmldnf/suggest_me_an_adventure_book_with_dinosaurs_for_a/"}
{"title": "Suggestion....", "body": "Suggest a book for self help(productivity/time management and self reflection)for an 18 yr", "comments": ["The ruthless elimination of hurry by John Comer", "The Executive Functioning Workbook for Teens by Sharon A. Hansen"], "suggested_books": ["The ruthless elimination of hurry", "The Executive Functioning Workbook for Teens"], "score": 1, "id": "1jmpv11", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmpv11/suggestion/"}
{"title": "Suggest a fantasy mystery book", "body": "I want to read a fantasy book that also includes some mystery. I like fast paced books with female leads.", "comments": ["The Tainted Cup by Robert Jackson Bennett", "*Witch King* by Martha C. Wells", "[This Gilded Abyss](https://www.goodreads.com/book/show/123854415-this-gilded-abyss) by Rebecca Thorne", "Even Though I Knew the End by C.L. Polk is detective noir mixed with urban fantasy with a female lead.", "Discount Armageddon by Seanan McGuire", "this is right up my alley thank youuu", "sounds so intriguing thank youuu", "immediately into my tbr", "this book sounds like everything ive ever dreamed of thank youu", "uhh ik im gonna like this tyy"], "suggested_books": ["The Tainted Cup", "*Witch King*", "Witch King", "Discount Armageddon"], "score": 1, "id": "1jmpspl", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmpspl/suggest_a_fantasy_mystery_book/"}
{"title": "fantasy book for my boyfriend and i to read", "body": "I’ve been trying to find a book for my boyfriends to read with me but all of my fantasy have too much romance or have the men written by women so it’s not exactly relatable for him to read. he enjoyed the Hobbit and LOTR series and plays video games like elden ring  does anyone have fantasy book suggestions, preferably from male POV? medieval fantasy is preferred!!", "comments": ["Women thoroughly enjoy fantasy books by men all the time -- I think your boyfriend could handle a book written by a woman! They don't all have a romance focus. Try *The Curse of Chalion* by Lois McMaster Bujold or the Inheritance Trilogy by N.K. Jemisin.", "Guy Gavriel Kay books.", "Brandon Sanderson might work. I've only read the Stormlight Archives, but he has other series in the same universe that have different flavors and aren't quite as long.", "R. A. Salvatore is entertaining, if lowbrow.", "The Legend of Eli Monpress\n\nLies of Locke Lamora\n\nWeis & Hickman’s Deathgate Cycle", "Jim Butcher Codex Alera series,", "i very rarely find a fmc pov written as well in a male authors in comparison to a female author. and we talked abt it where a mmc from a female author isn’t written as well as a male author", "my first thought is always characters from romance like acotar or fourth wing where the side characters might be more accurate but the you touch her and u die tropes r in most books ive personally read", "totally agree “Mistborn” is a perfect fantasy series where i don’t feel he wrote an “unbelievable” woman !!"], "suggested_books": ["The Curse of Chalion", "unbelievable", "Mistborn"], "score": 1, "id": "1jmpipz", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmpipz/fantasy_book_for_my_boyfriend_and_i_to_read/"}
{"title": "Immersive, approachable nature-inspired world building", "body": "For the first time In years I’ve read a few books I could not put down! It’s always hard to find the next one, and I’m learning what I like. My favs all have a really immersive world-building. I like learning/thinking about nature, philosophy/morality, spirituality and sometimes mythology.  Recent favs:  -The book thief (the world building, I still feel like I was there) -Piranasi (less so the mystery more the concept) -Circe (the living/thriving with the land, less so the fantasy)  Would like to move past YA but as a kid I LOVED books like hatchet, my side of the mountain, white fang, the secret garden, Julie of the wolves. I’ve enjoyed fantasy but would generally choose books rooted in the real/realish natural world   Would love suggestions!", "comments": ["The Gone-Away World.  Not massive world building but a well crafted tight scope.  Post apocalyptic world with corporations ruling and fun shenanigans.\n\nThe Acts of Caine, starting with Heroes Die.  Phenomenal world building and tons of philosophical aspects that are interesting to ponder.", "Book Thief, Piranesi, and Circe were all 5 star reads for me! I recommend:\n- Cloud Cuckoo Land by Anthony Doerr\n- The Light Pirate by Lily Brooks-Dalton\n- North Woods by Daniel Mason\n- When I Sing, Mountains Dance by Irene Sola", "It's middle-grade, but you might really like *The Birchbark House* books. They are very similar to *Little House on the Prairie* but with Ojibwe protagonists. The first couple take place in the woods and discuss some indigenous spirituality and mythology.\n\nYA, but both *A Snake Falls To Earth* and *Anna and the Swallow-Man.*\n\nHalf of *Snake* takes place in a world for animal spirits based on indigenous mythology. \n\n*Swallow-Man* is set during WWII where a strange man starts taking care of a girl when her father is arrested. He lectures to her about nature and morality while they travel around."], "suggested_books": ["- North Woods", "- Cloud Cuckoo Land", "- The Light Pirate", "- When I Sing, Mountains Dance", "The Birchbark House", "Swallow-Man", "Little House on the Prairie", "Anna and the Swallow-Man."], "score": 1, "id": "1jmor6k", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmor6k/immersive_approachable_natureinspired_world/"}
{"title": "a sexy book club read 💘", "body": "smutty…. but not too smutty, ya know 😂 one with spicy sex scenes but also has a good story line/plot/interesting characters.   This is for my monthly bookclub pick- so around 350 pages tops would be preferred 🙏", "comments": ["The Kiss Quotient"], "suggested_books": ["The Kiss Quotient"], "score": 1, "id": "1jmol7i", "url": "https://www.reddit.com/r/suggestmeabook/comments/1jmol7i/a_sexy_book_club_read/"}
